package com.example.poems;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class DatabaseHelper extends SQLiteOpenHelper {

    private static final String DB_NAME = "Poems"; //DB name
    private static final int DB_VERSION = 5; //DB version

    public DatabaseHelper(Context context) {
        super(context, DB_NAME, null, DB_VERSION);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        updateMyDatabase(db, 0, DB_VERSION);
    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        updateMyDatabase(db, oldVersion, newVersion);


    }

    private void updateMyDatabase(SQLiteDatabase db, int oldVersion, int newVersion) {
        if (oldVersion < 1) {
//            create db for gushi, chengyu, yingyucihui, cuotiji
            db.execSQL("CREATE TABLE POEM (_id INTEGER PRIMARY KEY AUTOINCREMENT," +
                    "POEM_ID INTEGER, TITLE TEXT, AUTHOR TEXT, CONTENT TEXT, DESCRIPTION TEXT, GRADE INTEGER, IS_PASS NUMERIC);");

            db.execSQL("CREATE TABLE IDIOM (_id INTEGER PRIMARY KEY AUTOINCREMENT," +
                    "IDIOM_ID INTEGER, IDIOM_NAME TEXT, IDIOM_SOURCE TEXT, IDIOM_MEANINGS TEXT);");

            db.execSQL("CREATE TABLE VOCABULARY (_id INTEGER PRIMARY KEY AUTOINCREMENT," +
                    "VOCABULARY_ID INTEGER, VOCABULARY_NAME TEXT, VOCABULARY_MEANING TEXT, VOCABULARY_EXAMPLE TEXT);");
            db.execSQL("CREATE TABLE WRONG_LIST (_id INTEGER PRIMARY KEY AUTOINCREMENT," +
                    "WRONG_LIST_ID INTEGER, WRONG_ITEM TEXT);");


            insertIdiomItems(db);
            insertVocabularyItems(db);
            insertWrongListItems(db);

            insertGradeOnePoems(db);
            insertGradeTwoPoems(db);
            insertGradeThreePoems(db);
            insertGradeFourPoems(db);
            insertGradeFivePoems(db);
            insertGradeSixPoems(db);
        }



    }

    private static void insertPoem(SQLiteDatabase db, int poemId, String title, String author, String content, String desc, int grade, boolean is_pass) {
        ContentValues poemValues = new ContentValues();
        poemValues.put("POEM_ID", poemId);
        poemValues.put("TITLE", title);
        poemValues.put("AUTHOR", author);
        poemValues.put("CONTENT", content);
        poemValues.put("DESCRIPTION", desc);
        poemValues.put("GRADE", grade);
        poemValues.put("IS_PASS", is_pass);
        db.insert("POEM", null, poemValues);
    }


    private static void insertGradeOnePoems(SQLiteDatabase db){
        insertPoem(db, 1001, "咏鹅", "唐 骆宾王",
                "鹅，鹅，鹅，\n曲项向天歌，\n白毛浮绿水，\n红掌拨清波。", "", 1, true);
        insertPoem(db, 1002, "江南", "汉乐府",
                "江南可采莲，\n莲叶何田田，\n鱼戏莲叶间，\n鱼戏莲叶东，\n鱼戏莲叶西，\n鱼戏莲叶南，\n鱼戏莲叶北。", "", 1, true);
        insertPoem(db, 1003, "画","唐 王维",
                "远看山有色，\n近听水无声。\n春去花还在，\n人来鸟不惊。\n", "", 1, true);
        insertPoem(db, 1004, "悯农（其二）","唐 李绅",
                "锄禾日当午， \n 汗滴禾下土。\n谁知盘中餐，\n粒粒皆辛苦。", "", 1, true);
        insertPoem(db, 1005, "古朗月行","唐 李白",
                "小时不识月，\n呼作白玉盘2。\n" +
                        "又疑瑶台镜3，\n飞在青云端。\n" +
                        "仙人垂两足4，\n桂树何团团5。\n" +
                        "白兔捣药成，\n问言与谁餐6？\n" +
                        "蟾蜍蚀圆影7，\n大明夜已残8。\n" +
                        "羿昔落九乌9，\n天人清且安10。\n" +
                        "阴精此沦惑11，\n去去不足观12。\n" +
                        "忧来其如何？\n凄怆摧心肝13。\n", "注释：\n" +
                        "1. 朗月行：乐府旧题。《乐府诗集》卷六五收录此题，列于《杂曲歌辞》。\t\t" +
                        "2. 呼作：称为。白玉盘：白玉做的盘子。\t\t" +
                        "3. 疑：怀疑。瑶台：传说中神仙居住的地方。《穆天子传》卷三：“天子宾于西王母，天子觞西王母于瑶池之上。西王母为天子谣曰：‘白云在天，山陵自出。道里悠远，山川间之。将子无死，尚能复来。’天子答之曰：‘予归东土，和治诸夏。万民平均，吾顾见汝。比及三年，将复而野。’”《武帝内传》称王母为“玄都阿母”。\t\t" +
                        "4. 仙人：传说驾月的车夫，叫望舒，又名纤阿。\t\t" +
                        "5. 何：一作“作”。团团：圆圆的样子。一作“团圆”。\t\t" +
                        "6. “白兔”二句：白兔老是忙着捣药，究竟是给谁吃呢？言外有批评长生不老药之意。问言：问。言，语助词，无实意。与谁：一作“谁与”。\t\t" +
                        "7. 蟾蜍：俗称癞蛤蟆。《五经通义》：“月中有兔与蟾蜍。”传说月中有三条腿的蟾蜍，因此古诗文常以“蟾蜍”指代月亮。但此诗中蟾蜍似另有所指。圆影：指月亮。\t\t" +
                        "8. 大明：指月亮。\t\t" +
                        "9. 羿（yì）：中国古代神话中射落九个太阳的英雄。《淮南子·本经训》记载：尧时十日并出，草木皆枯。尧命羿仰射十日，中其九。下面的“乌”即日。《五经通义》：“日中有三足乌。”所以日又叫阳乌。\t\t" +
                        "10. 天人：天上人间。\t\t" +
                        "11. 阴精：《史记·天官书》：“月者，天地之阴，金之精也。”阴精也指月。沦惑：沉沦迷惑。\t\t" +
                        "12. 去去：远去，越去越远。为决绝之辞。\t\t" +
                        "13. 凄怆：伤心之意。 \n", 1, true);
        insertPoem(db, 1006, "风","唐 李峤",
                "解落三秋叶，\n能开二月花。\n" +
                        "过江千尺浪，\n入竹万竿斜。\n", "《风》是唐代诗人李峤创作的一首诗。此诗通过抓住“叶”“花”“浪”“竹”四样自然界物象在风力作用下的易变，间接地表现了“风”之种种形力、魅力与威力：它能使晚秋的树叶脱落，能催开早春二月的鲜花，经过江河时能掀起千尺巨浪，刮进竹林时可把万棵翠竹吹得歪歪斜斜。全诗四句两两成偶，以“三”“二”“千”“万”数字对举排列来表现风的强大，也表达了诗人对大自然的敬畏之情。", 1, true);
        insertPoem(db, 1007, "春晓","唐 孟浩然",
                "春眠不觉晓，\n处处闻啼鸟。\n" +
                        "夜来风雨声，\n花落知多少。\n", "《春晓》是唐代诗人孟浩然隐居在鹿门山时所作，诗人抓住春天的早晨刚刚醒来时的一瞬间展开联想，描绘了一幅春天早晨绚丽的图景，抒发了诗人热爱春天、珍惜春光的美好心情。首句破题，写春睡的香甜；也流露着对朝阳明媚的喜爱；次句即景，写悦耳的春声，也交代了醒来的原因；三句转为写回忆，末句又回到眼前，由喜春翻为惜春。全诗语言平易浅近，自然天成，言浅意浓，景真情真，深得大自然的真趣。", 1, true);
        insertPoem(db, 1008, "赠汪伦","唐 李白",
                "李白乘舟将欲行，\n忽闻岸上踏歌声。\n" +
                        " 桃花潭水深千尺，\n不及汪伦送我情。\n", "《赠汪伦》是唐代大诗人李白于泾县（今安徽皖南地区）游历桃花潭时写给当地好友汪伦的一首留别诗。此诗前两句描绘李白乘舟欲行时，汪伦踏歌赶来送行的情景，朴素自然地表达出汪伦对李白那种朴实、真诚的情感；后两句先用“深千尺”赞美桃花潭水的深湛，紧接“不及”两个字笔锋一转，用衬托的手法，把无形的情谊化为有形的千尺潭水，生动形象地表达了汪伦对李白那份真挚深厚的友情。全诗语言清新自然，想象丰富奇特，虽仅四句二十八字，却是李白诗中流传最广的佳作之一。", 1, true);
        insertPoem(db, 1009, "静夜思","唐 李白",
                "床前明月光,\n疑是地上霜。\n" +
                        "举头望明月,\n低头思故乡。\n", "", 1, true);
        insertPoem(db, 1010, "寻隐者不遇","唐 贾岛",
                "松下问童子，\n言师采药去。\n只在此山中，\n云深不知处。\n", "", 1, true);
        insertPoem(db, 1011, "池上","唐 白居易",
                "小娃撑小艇，\n偷采白莲回。\n不解藏踪迹，\n浮萍一道开。\n", "", 1, true);
        insertPoem(db, 1012, "小池","宋 杨万里",
                "泉眼无声惜细流，\n树阴照水爱晴柔。\n小荷才露尖尖角，\n早有蜻蜓立上头。\n", "", 1, true);
        insertPoem(db, 1013, "画鸡","明 唐寅",
                "头上红冠不用裁，\n满身雪白走将来。\n平生不敢轻言语，\n一叫千门万户开。\n", "", 1, true);
    }


    private static void insertGradeTwoPoems(SQLiteDatabase db) {
        insertPoem(db, 2001, "梅花", "宋 王安石",
                "墙角数枝梅，\n凌寒独自开。\n遥知不是雪，\n为有暗香来。", "词句注释：\n" +
                        "1.凌寒：冒着严寒。\t" +
                        "2.遥：远远地。知：知道。\t" +
                        "3.为（wèi）：因为。暗香：指梅花的幽香。\n" +
                        "整体赏析：\n" +
                        "《梅花》是北宋诗人王安石创作的一首五言绝句。此诗前两句写墙角梅花不惧严寒，傲然独放；后两句写梅花的幽香，以梅拟人，凌寒独开，喻典品格高贵，暗香沁人，象征其才气谯溢。亦是以梅花的坚强和高洁品格喻示那些像诗人一样，处于艰难环境中依然能坚持操守、主张正义的人。全诗语言朴素，写得则非常平实内敛，却自有深致，耐人寻味。", 2, true);
        insertPoem(db, 2002, "小儿垂钓", "唐 胡令能",
                "蓬头稚子学垂纶1，\n侧坐莓苔草映身2。\n" +
                        "路人借问遥招手3，\n怕得鱼惊不应人4。\n", "词句注释：\n" +
                        "1.蓬头：形容小孩可爱。稚子：年龄小的、懵懂的孩子。垂纶（lún）：钓鱼。纶，钓鱼用的丝线。\t" +
                        "2. 莓（méi）：一种野草。苔：苔藓植物。映：遮映。\t" +
                        "3. 借问：向人打听问路。\t" +
                        "4. 应（yìng）：回应，答应，理睬。\n", 2, true);
        insertPoem(db, 2003, "登鹳雀楼", "唐 王之涣",
                "白日依山尽⑵，\n黄河入海流。\n" +
                        "欲穷千里目⑶，\n更上一层楼⑷。\n", "词句注释：\n" +
                        "⑴鹳雀楼：古名鹳鹊楼，因时有鹳鹊栖其上而得名，其故址在永济市境内古蒲州城外西南的黄河岸边。《蒲州府志》记载：“（鹳雀楼）旧在郡城西南黄河中高阜处，时有鹳雀栖其上，遂名。”\t" +
                        "⑵白日：太阳。依：依傍。尽：消失。 这句话是说太阳依傍山峦沉落。\t" +
                        "⑶欲：想要。穷：尽，使达到极点。千里目：眼界宽阔。\t" +
                        "⑷更：再。\n" +
                        "文学赏析\n" +
                        "这首诗写诗人在登高望远中表现出来的不凡的胸襟抱负，反映了盛唐时期人们积极向上的进取精神。\t" +
                        "书法家崔国伟行书《登鹳雀楼》\t" +
                        "书法家崔国伟行书《登鹳雀楼》\t" +
                        "前两句写所见。“白日依山尽”写山，“黄河入海流”写水。诗人遥望一轮落日向着楼前一望无际、连绵起伏的群山西沉，在视野的尽头冉冉而没；目送流经楼前下方的黄河奔腾咆哮、滚滚南来，又在远处折而东向，流归大海。诗人运用极其朴素、极其浅显的语言，既高度形象又高度概括地把进入广大视野的万里河山，收入短短十个字中，画面宽广辽远。\n" +
                        "知识拓展：\n" +
                        "四大名楼：四大名楼是一种泛称，特指山西永济鹳雀楼 、江西南昌滕王阁、湖北武汉黄鹤楼、湖南岳阳岳阳楼。", 2, true);
        insertPoem(db, 2004, "望庐山瀑布", "唐 李白",
                "日照香炉生紫烟，\n遥看瀑布挂前川。\n" +
                        "飞流直下三千尺，\n疑是银河落九天。\n", "词句注释：\n" +
                        "⑴庐山：又名匡山，中国名山之一。位于今江西省九江市北部的鄱阳湖盆地，在庐山区境内，耸立于鄱阳湖、长江之滨。\t" +
                        "⑵香炉峰：庐山香炉峰有四。此指南香炉峰。因烟云聚散，如香炉之状，故名。\t" +
                        "3. “日照”二句：一作“庐山上与星斗连，日照香炉生紫烟”。香炉：指香炉峰。紫烟：指日光透过云雾，远望如紫色的烟云。\t" +
                        "4. ”遥看：从远处看。挂：悬挂。前川：一作“长川”。川：河流，这里指瀑布。\t" +
                        "5. 直：笔直。三千尺：形容山高。这里是夸张的说法，不是实指。\t" +
                        "6. 疑：怀疑。银河：古人指银河系构成的带状星群。九天：极言天高。古人认为天有九重，九天是天的最高层，九重天，即天空最高处。\n", 2, true);
        insertPoem(db, 2005, "江雪", "唐 柳宗元",
                "千山鸟飞绝①，\n万径②人踪③灭。\n" +
                        "孤④舟蓑笠⑤翁，\n独⑥钓寒江雪。\n", "词句注释：\n" +
                        "①绝：无，没有。\t" +
                        "②万径：虚指，指千万条路。\t" +
                        "③人踪：人的脚印。\t" +
                        "④孤：孤零零。\t" +
                        "⑤蓑笠（suō lì）：蓑衣和斗笠。蓑：古代用来防雨的衣服；笠：古代用来防雨的帽子，用竹篾编成。\t" +
                        "⑥独：独自。\n" +
                        "诗词赏析：\n" +
                        "《江雪》是唐代诗人柳宗元于永州创作的一首五言绝句。诗中运用典型概括的手法，选择千山万径，人鸟绝迹这种最能表现山野严寒的典型景物，描绘大雪纷飞，天寒地冻的图景；接着勾画独钓寒江的渔翁形象，借以表达诗人在遭受打击之后不屈而又深感孤寂的情绪。全诗构思独特，语言简洁凝练，意蕴丰富。", 2, true);
        insertPoem(db, 2006, "夜宿山寺", "唐 李白",
                "危楼高百尺⑵，\n手可摘星辰⑶。\n" +
                        "不敢高声语⑷，\n恐惊天上人⑸。\n", "词句注释：\n" +
                        "⑴宿：住，过夜。\t" +
                        "⑵危楼：高楼，这里指山顶的寺庙。危：高。百尺：虚指，不是实数，这里形容楼很高。\t" +
                        "⑶星辰：天上的星星统称。\t" +
                        "⑷语：说话。\t" +
                        "⑸恐：唯恐，害怕。惊：惊动。\n" +
                        "诗词赏析：\n此诗运用了极其夸张的手法，描写了寺中楼宇的高耸，表达了诗人对古代庙宇工程艺术的惊叹以及对神仙般生活的向往和追求之情。全诗语言朴素自然，想象瑰丽，夸张巧妙，活灵活现，给人以丰富的联想和身临其境之感。\n", 2, true);
        insertPoem(db, 2007, "敕勒歌", "北朝民歌",
                "敕勒川②，\n" +
                        "阴山③下。\n" +
                        "天似穹庐④，\n" +
                        "笼盖四野⑤。\n" +
                        "天苍苍⑥，野茫茫⑦，\n" +
                        "风吹草低见牛羊⑧。\n", "词句注释：\n" +
                        "①《敕勒歌》：敕勒（chì lè）：种族名，北齐时居住在朔州（今山西省北部）一带。\t" +
                        "②敕勒川：川：平川、平原。敕勒族居住的地方，在现在的山西、内蒙一带。北魏时期把今河套平原至土默川一带称为敕勒川。\t" +
                        "③阴山：在今内蒙古自治区北部。\t" +
                        "④穹庐（qióng lú）：用毡布搭成的帐篷，即蒙古包。\t" +
                        "⑤笼盖四野（yǎ）：笼盖，另有版本作“笼罩”（洪迈《容斋随笔》卷一和胡仔《苕溪渔隐丛话》后集卷三十一）；四野，草原的四面八方。\t" +
                        "⑥天苍苍：苍苍：青色。苍，青，天苍苍，天蓝蓝的。\t" +
                        "⑦茫茫：辽阔无边的样子。\t" +
                        "⑧见（xiàn）：同“现”，显露。\n" +
                        "诗词赏析：\n《敕勒歌》选自《乐府诗集》，是南北朝时期黄河以北的北朝流传的一首民歌，一般认为是由鲜卑语译成汉语的。民歌歌咏了北国草原壮丽富饶的风光，抒写敕勒人热爱家乡热爱生活的豪情。 [1]  开头两句交代敕勒川位于高耸云霄的阴山脚下，将草原的背景衬托得十分雄伟。接着两句用“穹庐”作比喻，说天空如蒙古包，盖住了草原的四面八方，以此来形容极目远望，天野相接，无比壮阔的景象。最后三句描绘了一幅水草丰盛、牛羊肥壮的草原全景图。有静有动，有形象，有色彩。\n", 2, true);
        insertPoem(db, 2008, "村居", "清 高鼎",
                "草长莺飞二月天，\n拂堤杨柳醉春烟2。\n" +
                        "儿童散学归来早3，\n忙趁东风放纸鸢4。\n", "词句注释：\n" +
                        "1.村居：住在农村。\t" +
                        "2.拂堤杨柳：杨柳枝条很长，垂下来，微微摆动，像是在抚摸堤岸。醉：迷醉，陶醉。春烟：春天水泽、草木等蒸发出来的雾气。\t" +
                        "3.散学：放学。\t" +
                        "4.纸鸢：风筝。鸢，老鹰。\n" +
                        "诗词赏析：\n《村居》是清代诗人高鼎晚年归隐于上饶地区、闲居农村时创作的一首七言绝句。此诗第一、二句写时间和自然景物，具体生动地描写了春天里的大自然，写出了春日农村特有的明媚、迷人的景色；第三、四句写的是人物活动，描述了一群活泼的儿童在大好的春光里放风筝的生动情景。这首诗落笔明朗，用词洗练。全诗洋溢着欢快的情绪，给读者以美好的情绪感染。\n", 2, true);
        insertPoem(db, 2009, "咏柳", "唐 贺知章",
                "碧玉1妆2成一树3高，\n" +
                        "万条垂下绿丝绦4。\n" +
                        "不知细叶谁裁5出，\n" +
                        "二月春风似6剪刀。\n", "词句注释：\n" +
                        "1.碧玉：碧绿色的玉。这里用以比喻春天嫩绿的柳叶。\t" +
                        "2.妆：装饰，打扮。\t" +
                        "3.一树：满树。一：满，全。在中国古典诗词和文章中，数量词在使用中并不一定表示确切的数量。下一句的“万”，就是表示很多的意思。\t" +
                        "4.绦（tāo）：用丝编成的绳带。这里指像丝带一样的柳条。\t" +
                        "5.裁：裁剪。\t" +
                        "6.似：如同，好像。\n" +
                        "诗词赏析：\n《咏柳》是盛唐诗人贺知章写的一首七言绝句。这首诗是一首咏物诗。诗的前两句连用两个新美的喻象，描绘春柳的勃勃生气，葱翠袅娜；后两句更别出心裁地把春风比喻为“剪刀”，将视之无形不可捉摸的“春风”形象地表现出来，不仅立意新奇，而且饱含韵味。\n", 2, true);
        insertPoem(db, 2010, "赋得古原草送别", "唐 白居易",
                "离离原上草，\n一岁一枯荣。\n野火烧不尽，\n春风吹又生。\n" +
                        "远芳侵古道，\n晴翠接荒城。\n又送王孙去，\n萋萋满别情。\n", "词句注释：\n" +
                        "1.赋得：借古人诗句或成语命题作诗。诗题前一般都冠以“赋得”二字。这是古代人学习作诗或文人聚会分题作诗或科举考试时命题作诗的一种方式，称为\"赋得体\"。\t" +
                        "2.离离：青草茂盛的样子。\t" +
                        "3.一岁一枯荣：枯，枯萎。荣，茂盛。野草每年都会茂盛一次，枯萎一次。\t" +
                        "4.远芳侵古道：芳，指野草那浓郁的香气。远芳：草香远播。侵，侵占，长满。远处芬芳的野草一直长到古老的驿道上。\t" +
                        "5.晴翠：草原明丽翠绿。\t" +
                        "6.王孙：本指贵族后代，此指远方的友人。\t" +
                        "7.萋萋：形容草木长得茂盛的样子。\n" +
                        "白话译文\n" +
                        "原野上长满茂盛的青草，年年岁岁枯萎了又苍翠。\t" +
                        "原野上的大火无法烧尽，春风一吹它又生机勃发。\t" +
                        "芳草的馨香弥漫着古道，阳光照耀下碧绿连荒城。\t" +
                        "又送游子远行踏上古道，满怀离情望着萋萋芳草。\n" +
                        "诗词赏析：\n《赋得古原草送别》是唐代诗人白居易的成名作。此诗通过对古原上野草的描绘，抒发送别友人时的依依惜别之情。它可以看成是一曲野草颂，进而是生命的颂歌。诗的前四句侧重表现野草生命的历时之美，后四句侧重表现其共时之美。全诗章法谨严，用语自然流畅，对仗工整，写景抒情水乳交融，意境浑成，是“赋得体”中的绝唱。\n", 2, true);
        insertPoem(db, 2011, "晓出净慈寺送林子方", "宋 杨万里",
                "毕竟西湖六月中，\n风光不与四时同。\n" +
                        "接天莲叶无穷碧，\n映日荷花别样红。\n", "词句注释：\n" +
                        "⑴晓：天刚亮的时候。净慈寺：在杭州西湖南岸，全名“净慈报恩光孝禅寺”，与灵隐寺为杭州西湖南北山两大著名佛寺。林子方：即林枅，字子方，作者的朋友，官居直阁秘书。\t" +
                        "⑵荡：浅水湖。\t" +
                        "⑶却：回转。\t" +
                        "⑷毕竟： 到底，言外有名不虚传的意味。\t" +
                        "⑸四时：春夏秋冬四个季节。在这里指六月以外的其他时节。同：相同。\t" +
                        "⑹接天：像与天空相接。无穷碧：因莲叶面积很广，似与天相接，故呈现无边无际的碧绿。\t" +
                        "⑺别样红：红得特别出色。别样，宋代俗语，特别，不一样。\n" +
                        "白话译文：\n" +
                        "六月里的西子湖啊，到底特殊，秀丽的风光和其他时节迥然不同。\n" +
                        "碧绿的莲叶连接天际，浩渺无尽，红日与荷花相映，色彩分外鲜艳娇红。\n" +
                        "诗词赏析：\n其首二句以“毕竟”二字领起，一气而下，既协调了平仄，又强调了内心在瞬间掠过的独特感受。然后顺理成章，具体描绘这使他为之倾倒与动情的特异风光，着力表现在一片无穷无尽的碧绿之中那红得“别样”、娇艳迷人的荷花，将六月西湖那迥异于平时的绮丽景色，写得十分传神。诗的后两句是互文，文义上交错互见，使诗句既意韵生动，又凝练含蓄。\n", 2, true);
        insertPoem(db, 2012, "绝句", "唐 杜甫",
                "两个黄鹂鸣翠柳，\n一行白鹭上青天。\n" +
                        "窗含西岭千秋雪，\n门泊东吴万里船。\n", "词句注释：\n" +
                        "1.黄鹂：黄莺，鸣声悦耳。\t" +
                        "2.白鹭：鹭鸶，羽毛纯白，能高飞。\t" +
                        "3.窗含：谓由窗往外望西岭，好似嵌在窗框中，故曰窗含。西岭：即成都西南的岷山，其雪常年不化，故云千秋雪。这是想象之词。\t" +
                        "4.东吴：指长江下游的江苏一带。成都水路通长江，故云东吴万里船。\n" +
                        "白话译文：\n" +
                        "两只黄鹂在翠绿的柳枝间鸣叫，一行白鹭向湛蓝的高空里飞翔。\n" +
                        "西岭雪山的景色仿佛嵌在窗里，往来东吴的航船就停泊在门旁。\n" +
                        "诗词赏析：\n诗描写早春景象，四句四景，又融为一幅生机勃勃的图画，在欢快明亮的景象内，寄托着诗人对时光流逝、孤独无聊的失落之意。\n", 2, true);
        insertPoem(db, 2013, "悯农（其一）", "唐 李绅",
                "春种一粒粟⑵，\n秋收万颗子⑶。\n" +
                        "四海无闲田⑷，\n农夫犹饿死⑸。\n", "词句注释：\n" +
                        "⑴悯：怜悯。这里有同情的意思。诗一作《古风二首》。这两首诗的排序各版本有所不同。\t" +
                        "⑵粟：泛指谷类。\t" +
                        "⑶秋收：一作“秋成”。子：指粮食颗粒。\t" +
                        "⑷四海：指全国。闲田：没有耕种的田。\t" +
                        "⑸犹：仍然。\n" +
                        "白话译文：\n" +
                        "春天播种下一粒种子，到了秋天就可以收获很多的粮食。\n" +
                        "天下没有一块不被耕作的田，可仍然有种田的农夫饿死。\n" +
                        "诗词赏析：\n具体而形象地描绘了到处硕果累累的景象，突出了农民辛勤劳动获得丰收却两手空空、惨遭饿死的现实问题。\n", 2, true);
        insertPoem(db, 2014, "舟夜书所见", "清 查慎行",
                "月黑见渔灯2，\n孤光一点萤3。\n" +
                        "微微风簇浪4，\n散作满河星。\n", "词句注释：\n" +
                        "1.舟夜书所见：夜晚在船上记下所看见的景象。书，记、写。\t" +
                        "2.渔灯：渔船上的灯火。\t" +
                        "3.孤光：孤零零的灯光。萤：萤火虫，比喻灯光像萤火虫一样微弱。\t" +
                        "4.风簇浪：风吹起了波浪。簇，聚集，簇拥。\n" +
                        "白话译文：\n" +
                        "漆黑之夜不见月亮，只见那渔船上的灯光，孤独的灯光在茫茫的夜色中，像萤火虫一样发出一点微亮。\n" +
                        "微风阵阵，河水泛起层层波浪，渔灯微光在水面上散开，河面好像撤落无数的星星。\n" +
                        "诗词赏析：\n《舟夜书所见》是清代诗人查慎行创作的一首五言绝句。此诗前两句写黑夜舟中见渔灯，茫茫黑夜只有河中一盏渔灯，明暗鲜明且显得神秘、深沉；后两句写孤灯倒影的美景，微风吹起波浪，灯影随即散开像散落在满河的星星。全诗纯用白描，以大景衬小景，以暗景衬亮景，刻画细腻，生动形象。\n", 2, true);
    }

    private static void insertGradeThreePoems(SQLiteDatabase db) {
        insertPoem(db, 3001, "所见", "清 袁枚",
                "牧童2骑黄牛3，\n歌声振4林樾5。\n" +
                        "意欲6捕鸣蝉7，\n忽然闭口8立。\n", "词句注释：\n" +
                        "1.所见：写诗人所看见的事物。\t" +
                        "2.牧童：放牧牛羊的小孩。这里是指放牛的娃娃。\t" +
                        "3.黄牛：牛的一种毛多呈黄色，也有黑色或红棕色。能耕地拉车，体型比水牛小。一般分为蒙古牛、华北牛和华南牛三大类型。\t" +
                        "4.振：振荡；回荡。说明牧童的歌声嘹亮。\t" +
                        "5.林樾（yuè）：指道旁成阴的树林。樾，树荫。\t" +
                        "6.意欲：想要。\t" +
                        "7.鸣蝉：鸣叫的知了。\t" +
                        "8.闭口：闭上嘴巴，不发出声音的意思。\n" +
                        "白话译文：\n" +
                        "牧童骑在黄牛背上，嘹亮的歌声在林中回荡。\n" +
                        "忽然想要捕捉树上鸣叫的知了，就马上停止唱歌，一声不响地站立在树旁。\n" +
                        "诗词赏析：\n" +
                        "《所见》是清代文学家袁枚创作的一首五言绝句。此诗写了作者偶然所见牧童骑牛唱歌想捕捉知了的一件小事，通过对牧童的动作神态变化的描写，表现了牧童天真活泼机智灵活的性格和热爱大自然情趣的特点。描绘了一幅林中牧童一派天真快乐的画面，表达了作者对田园风光的喜爱之情。全诗通过对自然环境和社会生活的描写，直接抒发生活的感受，看似闲情逸致，实则寄托情思，用语活泼自由、浅显明了。\n",
                3, false);
        insertPoem(db, 3002, "山行", "唐 杜牧",
                "远上寒山石径斜⑵，\n白云生处有人家⑶。\n" +
                        "停车坐爱枫林晚⑷，\n霜叶红于二月花⑸。\n", "词句注释：\n" +
                        "⑴山行：在山中行走。\t" +
                        "⑵远上：登上远处的。寒山：深秋季节的山。石径：石子铺成的小路。\t" +
                        "⑶生：明万历赵宦光刊本《万首唐人绝句》、明高棅编《唐诗品汇》、清陈梦雷编《古今图书集成》和康熙《御定全唐诗》作“深”。\t" +
                        "⑷坐：因为。枫林晚：傍晚时的枫树林。\t" +
                        "⑸霜叶：枫树的叶子经深秋寒霜之后变成了红色。于：比。\n" +
                        "白话译文：\n" +
                        "弯曲的石头小路远远地伸至深秋的山巅，在白云升腾的地方隐隐约约有几户人家。\n" +
                        "停下马车来是因为喜爱深秋枫林的晚景，霜染后枫叶那鲜艳的红色胜过二月春花。\n" +
                        "诗词赏析：\n" +
                        "《山行》是唐代诗人杜牧创作的一首诗。此诗描绘秋日山行所见的景色，展现出一幅动人的山林秋色图，山路、人家、白云、红叶，构成一幅和谐统一的画面，表现了作者的高怀逸兴和豪荡思致。作者以情驭景，敏捷、准确地捕捉足以体现自然美的形象，并把自己的情感融汇其中，使情感美与自然美水乳交融，情景互为一体。全诗构思新颖，布局精巧，于萧瑟秋风中摄取绚丽秋色，与春光争胜，令人赏心悦目，精神发越。\n",
                3, true);
        insertPoem(db, 3003, "赠刘景文", "北宋 苏轼",
                "荷尽已无擎雨盖⑵，\n" +
                        "菊残犹有傲霜枝⑶。\n" +
                        "一年好景君须记⑷，\n" +
                        "正是橙黄橘绿时⑸。\n",
                "释义：\n⑴刘景文：刘季孙，字景文，工诗，时任两浙兵马都监，驻杭州。苏轼视他为国士，曾上表推荐，并以诗歌唱酬往来。\t" +
                        "⑵荷尽：荷花枯萎，残败凋谢。擎：举，向上托。雨盖：旧称雨伞，诗中比喻荷叶舒展的样子。\t" +
                        "⑶菊残：菊花凋谢。犹：仍然。傲霜：不怕霜动寒冷，坚强不屈。\t" +
                        "⑷君：原指古代君王，后泛指对男子的敬称，您。须记：一定要记住。\t" +
                        "⑸正是：一作“最是”。橙黄橘绿时：指橙子发黄、橘子将黄犹绿的时候，指农历秋末冬初。\n" +
                        "译文：\n 荷花凋谢连那擎雨的荷叶也枯萎了，只有那开败了菊花的花枝还傲寒斗霜。一年中最好的景致你一定要记住，那就是在橙子金黄、橘子青绿的秋末冬初的时节啊。\n" +
                        "整体赏析:\n" +
                        "这首诗写的是初冬的景色。\n", 3, false);
        insertPoem(db, 3004, "夜书所见", "南宋 叶绍翁",
                "萧萧①梧叶送寒声，\n江上秋风动客情②。\n" +
                        "知有儿童挑③促织④，\n夜深篱落⑤一灯明。\n",
                "释义：\n" +
                        "①萧萧：风声。\t" +
                        "②客情：旅客思乡之情。\t" +
                        "③挑：用细长的东西拨动。\t" +
                        "④促织：俗称蟋蟀，有的地区又叫蛐蛐。\t" +
                        "⑤篱落：篱笆。\n" +
                        "译文：\n " +
                        "萧萧秋风吹动梧叶，送来阵阵寒意，客游在外的游子不禁思念起自己的家乡。\n" +
                        "忽然看到远处篱笆下的灯火，料想是孩子们在捉蟋蟀。\n" +
                        "整体赏析:\n" +
                        "《夜书所见》是南宋诗人叶绍翁所作的七言古诗。诗一二两句写景，借落叶飘飞、秋风瑟瑟、寒气袭人烘托游子漂泊流浪、孤单寂寞的凄凉之感。三四两句写儿童夜捉蟋蟀，兴致高昂，巧妙地反衬悲情，更显客居他乡的孤寂无奈。该诗以景衬情，动静结合，以梧叶声和风声衬出秋夜的寂静，还运用了对比手法，以儿童夜捉促织的乐景反衬自己客居他乡的悲情。\n", 3, false);
        insertPoem(db, 3005, "望天门山", "唐 李白",
                "天门中断楚江开2，\n碧水东流至此回3。\n" +
                        "　　两岸青山相对出4，\n孤帆一片日边来5。\n",
                "释义：\n" +
                        "1.天门山：位于今安徽省当涂县西南长江两岸，东为东梁山（又称博望山），西为西梁山（又称梁山）。两山隔江对峙，形同天设的门户，天门由此得名。《江南通志》记云：“两山石状晓岩，东西相向，横夹大江，对峙如门。俗呼梁山曰西梁山，呼博望山曰东梁山，总谓之天门山。”\t" +
                        "2.中断：江水从中间隔断两山。楚江：长江流经旧楚地的一段，当涂在战国时期属楚国，故流经此地的长江称楚江。开：劈开，断开。\t" +
                        "3.至此：意为东流的江水在这转向北流。一作“直北”，一作“至北”。回：回漩，回转。指这一段江水由于地势险峻方向有所改变，并更加汹涌。\t" +
                        "4.两岸青山：分别指东梁山和西梁山。出：突出，出现。\t" +
                        "5.日边来：指孤舟从天水相接处的远方驶来，远远望去，仿佛来自日边。\n" +
                        "译文：\n 天门山从中间断裂是楚江把它冲开，碧水向东浩然奔流到这里折回。\n" +
                        "　　两岸高耸的青山隔着长江相峙而立，江面上一叶孤舟像从日边驶来。\n" +
                        "整体赏析:\n" +
                        "《望天门山》是唐代大诗人李白于开元十三年（725年）赴江东途中行至天门山时所创作的一首七绝。此诗描写了诗人舟行江中顺流而下远望天门山的情景：前两句用铺叙的方法，描写天门山的雄奇壮观和江水浩荡奔流的气势；后两句描绘出从两岸青山夹缝中望过去的远景，显示了一种动态美。全诗通过对天门山景象的描述，赞美了大自然的神奇壮丽，表达了作者初出巴蜀时乐观豪迈的感情，展示了作者自由洒脱、无拘无束的精神风貌。作品意境开阔，气象雄伟，动静虚实，相映成趣，并能化静为动，化动为静，表现出一种新鲜的意趣。\n", 3, false);
        insertPoem(db, 3006, "饮湖上初晴后雨", "北宋 苏轼",
                "水光潋滟晴方好，\n山色空濛雨亦奇。\n" +
                        "欲把西湖比西子，\n淡妆浓抹总相宜。\n",
                "释义：\n" +
                        "⑴饮湖上：在西湖的船上饮酒。\t" +
                        "2.潋滟：水波荡漾、波光闪动的样子。 方好：正显得美。\t" +
                        "3.空濛：细雨迷濛的样子。濛，一作“蒙”。亦：也。奇：奇妙。\t" +
                        "4.欲：可以；如果。西子：即西施，春秋时代越国著名的美女。\t" +
                        "5.总相宜：总是很合适，十分自然。\n" +
                        "译文：\n " +
                        "晴天，西湖水波荡漾，在阳光照耀下，光彩熠熠，美极了。下雨时，远处的山笼罩在烟雨之中，时隐时现，眼前一片迷茫，这朦胧的景色也是非常漂亮的。如果把美丽的西湖比作美人西施，那么淡妆也好，浓妆也罢，总能很好地烘托出她的天生丽质和迷人神韵。" +
                        "整体赏析:\n" +
                        "《饮湖上初晴后雨二首》是宋代文学家苏轼的组诗作品。这两首赞美西湖美景的七绝，写于诗人任杭州通判期间。其中第二首广为流传，此诗不是描写西湖的一处之景、一时之景，而是对西湖美景的全面描写概括品评，尤其是后二句，被认为是对西湖的恰当评语。\n", 3, false);

        insertPoem(db, 3007, "望洞庭", "唐 刘禹锡",
                "湖光秋月两相和2，\n潭面无风镜未磨3。\n" +
                        "遥望洞庭山水翠4，\n白银盘里一青螺5。\n",
                "释义：\n" +
                        "1.洞庭：湖名，在今湖南省北部。\t" +
                        "2.湖光：湖面的波光。两：指湖光和秋月。和：和谐。指水色与月光交相辉映。\t" +
                        "3.潭面：指湖面。镜未磨：古人的镜子用铜制作、磨成。此句意思一说是湖面无风，水平如镜；一说是远望湖中的景物，隐约不清，如同镜面没打磨时照物模糊。\t" +
                        "4.山水翠：一作“山水色”。山，指洞庭湖中的君山。\t" +
                        "5.白银盘：形容平静而又清的洞庭湖面。白银，一作“白云”。青螺：这里用来形容洞庭湖中的君山。\n" +
                        "译文：\n " +
                        "洞庭湖上月光和水色交相融和，湖面风平浪静如同未磨的铜镜。\n" +
                        "远远眺望洞庭湖山水苍翠如墨，好似洁白银盘里托着一枚青螺。\n" +
                        "整体赏析:\n" +
                        "《望洞庭》是唐代文学家刘禹锡创作的一首诗。此诗描写了秋夜月光下洞庭湖的优美景色，表达了诗人对洞庭风光的喜爱和赞美之情，表现了诗人壮阔不凡的气度和高卓清奇的情致。首句描写湖水与素月交相辉映的景象，第二句描绘无风时湖面平静的情状，第三、四句集中描写湖中的君山。全诗选择了月夜遥望的角度，把千里洞庭尽收眼底，抓住最有代表性的湖光山色，轻轻着笔，通过丰富的想象、巧妙的比喻，独出心裁地把洞庭美景再现于纸上，显示出惊人的艺术功力。\n", 3, false);
        insertPoem(db, 3008, "早发白帝城", "唐 李白",
                "朝辞白帝彩云间2，\n千里江陵一日还3。\n" +
                        "两岸猿声啼不住4，\n轻舟已过万重山5。\n",
                "释义：\n" +
                        "1.发：启程。白帝城：故址在今重庆市奉节县白帝山上。\t" +
                        "2.朝：早晨。辞：告别。彩云间：因白帝城在白帝山上，地势高耸，从山下江中仰望，仿佛耸入云间。白帝：今重庆市奉节县东白帝山，山上有白帝城，位于长江上游。\t" +
                        "3.江陵：今湖北省荆州市。从白帝城到江陵约一千二百里，其间包括七百里三峡。\t" +
                        "4.猿：猿猴。啼：鸣、叫。住：停息。一作“尽”。\n" +
                        "5.轻舟已过：一作“须臾过却”。万重山：层层叠叠的山，形容有许多。\n" +
                        "译文：\n " +
                        "清晨告别白云之间的白帝城，千里外的江陵一日就能到达。\n" +
                        "江两岸的猿在不停地啼叫着，轻快的小舟已驶过万重青山。\n" +
                        "整体赏析:\n" +
                        "《早发白帝城》是唐代伟大诗人李白在乾元二年（759年）流放途中遇赦返回时所创作的一首七绝，是李白诗作中流传最广的名篇之一。此诗意在描摹自白帝至江陵一段长江，水急流速，舟行若飞的情况。首句写白帝城之高；二句写江陵路遥，舟行迅速；三句以山影猿声烘托行舟飞进；四句写行舟轻如无物，点明水势如泻。全诗把诗人遇赦后愉快的心情和江山的壮丽多姿、顺水行舟的流畅轻快融为一体，运用夸张和奇想，写得流丽飘逸，惊世骇俗，又不假雕琢，随心所欲，自然天成。明人杨慎赞曰：“惊风雨而泣鬼神矣！”\n", 3, false);
        insertPoem(db, 3009, "采莲曲", "唐 王昌龄",
                "荷叶罗裙一色裁⑷，\n芙蓉向脸两边开⑸。\n" +
                        "乱入池中看不见⑹，\n闻歌始觉有人来。\n",
                "释义：\n" +
                        "⑴采莲曲：古曲名。内容多描写江南一带水国风光，采莲女劳动生活情态。\t" +
                        "2.罗裙：用细软而有疏孔的丝织品制成的裙子。一色裁：像是用同一颜色的衣料剪裁的。\t" +
                        "3.芙蓉：指荷花。\t" +
                        "4.看不见：指分不清哪是芙蓉的绿叶红花，哪是少女的绿裙红颜。\n" +
                        "译文：\n " +
                        "采莲女的罗裙绿得像荷叶一样，出水的荷花正朝着采莲女的脸庞开放。碧罗裙芙蓉面混杂在荷花池中难以辨认，听到歌声才发觉池中有人来采莲。\n" +
                        "整体赏析:\n" +
                        "以写意法，表现采莲女子的整体印象，诗人将采莲少女置于荷花丛中，若隐若现，若有若无，使少女与大自然融为一体，使全诗别具一种引人遐想的优美意境。”\n", 3, false);
        insertPoem(db, 3010, "绝句二首 其一", "唐 杜甫",
                "迟日江山丽⑴，\n春风花草香。\n" +
                        "泥融飞燕子⑵，\n沙暖睡鸳鸯⑶。\n",
                "释义：\n" +
                        "⑴迟日：春天日渐长，所以说迟日。\t" +
                        "⑵泥融：这里指泥土滋润、湿润。\t" +
                        "⑶鸳鸯：一种水鸟，雄鸟与雌鸟常双双出没。\n" +
                        "译文：\n " +
                        "江山沐浴着春光，多么秀丽，春风送来花草的芳香。\n" +
                        "燕子衔着湿泥忙筑巢，暖和的沙子上睡着成双成对的鸳鸯。\n" +
                        "整体赏析:\n" +
                        "《绝句二首》是唐代诗人杜甫创作的组诗作品。这是一组咏物诗，第一首用自然流畅的语言写出了一派生意盎然的春色，格调清新，意境明丽，表达了诗人热爱大自然的愉快心情。这两首诗极生动地、自然地描绘出充满生机的春色之美，反映了杜甫经过漂泊的磨难后，在草堂暂得生活安宁而产生的闲适情怀。”\n", 3, false);
        insertPoem(db, 3011, "惠崇春江晚景", "北宋 苏轼",
                "竹外桃花三两枝，\n春江水暖鸭先知。\n" +
                        "蒌蒿满地芦芽短⑵，\n正是河豚欲上时⑶。\n",
                "释义：\n" +
                        "⑴惠崇（亦为慧崇）：福建建阳僧，宋初九僧之一，能诗能画。\t" +
                        "⑵蒌蒿(lóu hāo)：草名，有青蒿、白蒿等种。《诗经》“呦呦鹿鸣，食野之蒿。”芦芽：芦苇的幼芽，可食用。\t" +
                        "⑶河豚：鱼的一种，学名“鲀”，肉味鲜美，但是卵巢和肝脏有剧毒。产于我国沿海和一些内河。每年春天逆江而上，在淡水中产卵。上：指逆江而上。\n" +
                        "译文：\n " +
                        "竹林外两三枝桃花初放，鸭子在水中游戏，它们最先察觉了初春江水的回暖。" +
                        "河滩上已经满是蒌蒿，芦笋也开始抽芽，而河豚此时正要逆流而上，从大海回游到江河里来了。\n" +
                        "整体赏析:\n" +
                        "《惠崇春江晚景二首》是北宋文学家苏轼题惠崇的《春江晚景》所创作的组诗。第一首诗题“鸭戏图”，再现了原画中的江南仲春景色，又融入诗人合理的想象，与原画相得益彰。”\n", 3, false);
        insertPoem(db, 3012, "三衢道中", "南宋 曾几",
                "梅子黄时②日日晴，\n" +
                        "小溪泛尽③却山行④。\n" +
                        "绿阴⑤不减⑥来时路，\n" +
                        "添得黄鹂⑦四五声。\n",
                "释义：\n" +
                        "①三衢（qú）道中：在去三衢州的道路上。三衢即衢州，今浙江省常山县，因境内有三衢山而得名。\t" +
                        "②梅子黄时：指五月，梅子成熟的季节。\t" +
                        "③小溪泛尽：乘小船走到小溪的尽头。小溪，小河沟。泛，乘船。尽，尽头。\t" +
                        "④却山行：再走山间小路。却，再的意思。\t" +
                        "⑤绿阴：苍绿的树阴。阴，树阴。\t" +
                        "⑥不减：并没有少多少，差不多。\t" +
                        "⑦黄鹂（lí）：黄莺。\n" +
                        "译文：\n " +
                        "梅子黄透了的时候，天天都是晴和的好天气，乘小舟沿着小溪而行，走到了小溪的尽头，再改走山路继续前行。山路上苍翠的树，与来的时候一样浓密，深林丛中传来几声黄鹂的欢鸣声，比来时更增添了些幽趣。\n" +
                        "整体赏析:\n" +
                        "《三衢道中》是南宋诗人曾几创作的一首七言绝句。首句写出行时间，次句写出行路线，第三句写绿阴那美好的景象仍然不减登山时的浓郁，第四句写黄莺声，路边绿林中又增添了几声悦耳的黄莺的鸣叫声，为三衢山的道中增添了无穷的生机和意趣。全诗明快自然，极富有生活韵味。”\n", 3, false);
        insertPoem(db, 3013, "忆江南", "唐 白居易",
                "江南好，\n风景旧曾谙。\n日出江花红胜火，\n春来江水绿如蓝，\n能不忆江南？" +
                        "江南忆，\n最忆是杭州。\n山寺月中寻桂子，\n郡亭枕上看潮头。\n何日更重游？\n" +
                        "江南忆，\n其次忆吴宫。\n吴酒一杯春竹叶，\n吴娃双舞醉芙蓉。\n早晚复相逢？\n",
                "译文： \n" +
                        "江南的风景多么美好，风景久已熟悉。春天到来时，太阳从江面升起，把江边的鲜花照得比火红，碧绿的江水绿得胜过蓝草。怎能叫人不怀念江南？\n" +
                        "整体赏析: \n" +
                        "忆江南，本为唐教坊曲名，后用作词牌名。唐朝白居易晚年所作，为追忆青年时期，漫游江南，旅居苏杭所感受到的江南盛景。三首忆江南，用几十个字将江南美景跃然眼前，令人心驰神往。这三首诗也因此流传至今，已是一千多年。", 3, true);
        insertPoem(db, 3014, "元日", "北宋 王安石",
                "爆竹声中一岁除⑵，\n" +
                        "春风送暖入屠苏⑶。\n" +
                        "千门万户曈曈日⑷，\n" +
                        "总把新桃换旧符⑸。\n",
                "释义：\n" +
                        "⑴元日：农历正月初一，即春节。\t" +
                        "⑵爆竹：古人烧竹子时使竹子爆裂发出的响声。用来驱鬼避邪，后来演变成放鞭炮。一岁除：一年已尽。除，逝去。\t" +
                        "⑶屠苏：“指屠苏酒，饮屠苏酒也是古代过年时的一种习俗，大年初一全家合饮这种用屠苏草浸泡的酒，以驱邪避瘟疫，求得长寿。\t" +
                        "⑷千门万户：形容门户众多，人口稠密。曈曈：日出时光亮而温暖的样子。\t" +
                        "⑸桃：桃符，古代一种风俗，农历正月初一时人们用桃木板写上神荼、郁垒两位神灵的名字，悬挂在门旁，用来压邪。也作春联。\n" +
                        "译文：\n " +
                        "阵阵轰鸣的爆竹声中，旧的一年已经过去；和暖的春风吹来了新年，人们欢乐地畅饮着新酿的屠苏酒。初升的太阳照耀着千家万户，他们都忙着把旧的桃符取下，换上新的桃符。\n" +
                        "整体赏析:\n" +
                        "《元日》是北宋政治家王安石创作的一首七言绝句。这首诗描写新年元日热闹、欢乐和万象更新的动人景象，抒发了作者革新政治的思想感情，充满欢快及积极向上的奋发精神。”\n", 3, false);
        insertPoem(db, 3015, "清明", "唐 杜牧",
                "清明时节雨纷纷⑵，\n路上行人欲断魂⑶。\n" +
                        "借问酒家何处有⑷？\n牧童遥指杏花村⑸。\n",
                "释义：\n" +
                        "⑴清明：二十四节气之一，在阳历四月五日前后。旧俗当天有扫墓、踏青、插柳等活动。宫中以当天为秋千节，坤宁宫及各后宫都安置秋千，嫔妃做秋千之戏。\t" +
                        "⑵纷纷：形容多。\t" +
                        "⑶欲断魂：形容伤感极深，好像灵魂要与身体分开一样。断魂：神情凄迷，烦闷不乐。这两句是说，清明时候，阴雨连绵，飘飘洒洒下个不停；如此天气，如此节日，路上行人情绪低落，神魂散乱。\t" +
                        "⑷借问：请问。\t" +
                        "⑸杏花村：杏花深处的村庄，位于南京市秦淮区凤台山一带。受此诗影响，后人多用“杏花村”作酒店名。\n " +
                        "译文：\n  江南清明时节细雨纷纷飘洒，路上羁旅行人个个落魄断魂。\n" +
                        "借问当地之人何处买酒浇愁？牧童笑而不答遥指杏花山村。\n" +
                        "整体赏析:\n" +
                        "《清明》是唐代文学家杜牧的诗作。此诗写清明春雨中所见，色彩清淡，心境凄冷，历来广为传诵。第一句交代情景、环境、气氛；第二句写出了人物，显示了人物的凄迷纷乱的心境；第三句提出了如何摆脱这种心境的办法；第四句写答话带行动，是整篇的精彩所在。全诗运用由低而高、逐步上升、高潮顶点放在最后的手法，余韵邈然，耐人寻味。”\n", 3, false);
        insertPoem(db, 3016, "九月九日忆山东兄弟", "唐 王维",
                "独在异乡为异客⑵，\n每逢佳节倍思亲⑶。\n" +
                        "遥知兄弟登高处⑷，\n遍插茱萸少一人⑸。\n",
                "释义：\n" +
                        "⑴九月九日：即重阳节。古以九为阳数，故曰重阳。忆：想念。山东：王维迁居于蒲县（今山西永济县），在函谷关与华山以东，所以称山东。\t" +
                        "⑵异乡：他乡、外乡。 为异客：作他乡的客人。\t" +
                        "⑶佳节：美好的节日。\t" +
                        "⑷登高：古有重阳节登高的风俗。\t" +
                        "⑸茱萸（zhūyú）：一种香草，即草决明。古时人们认为重阳节插戴茱萸可以避灾克邪。\n " +
                        "译文：\n  独自离家在外地为他乡客人，每逢佳节来临格外思念亲人。\n" +
                        "遥想兄弟们今日登高望远时，头上插茱萸可惜只少我一人。\n" +
                        "整体赏析:\n" +
                        "《九月九日忆山东兄弟》是唐代诗人王维的名篇之一。此诗写出了游子的思乡怀亲之情。诗一开头便紧切题目，写异乡异土生活的孤独凄然，因而时时怀乡思人，遇到佳节良辰，思念倍加。接着诗一跃而写远在家乡的兄弟，按照重阳节的风俗而登高时，也在怀念自己。诗意反复跳跃，含蓄深沉，既朴素自然，又曲折有致。其中“每逢佳节倍思亲”更是千古名句。”\n", 3, false);
        insertPoem(db, 3017, "滁州西涧", "唐 韦应物",
                "独怜幽草涧边生，\n上有黄鹂深树鸣。\n" +
                        "春潮带雨晚来急，\n野渡无人舟自横。\n",
                "释义：\n" +
                        "⑴滁州：在今安徽滁州以西。西涧：在滁州城西，俗名称上马河。　\t" +
                        "　　⑵独怜：唯独喜欢。幽草：幽谷里的小草。幽，一作“芳”。生：一作“行”。\t" +
                        "⑶深树：枝叶茂密的树。深，《才调集》作“远”。树，《全唐诗》注“有本作‘处’”。\t" +
                        "⑷春潮：春天的潮汐。\t" +
                        "⑸野渡：郊野的渡口。横：指随意漂浮。\n " +
                        "译文：\n  我喜爱生长在涧边的幽草，黄莺在幽深的树丛中啼鸣。\n" +
                        "春潮夹带着暮雨流的湍急，惟有无人的小船横向江心。\n" +
                        "整体赏析:\n" +
                        "《滁州西涧》是唐代诗人韦应物的一首写景七绝。作者任滁州剌史时，游览至滁州西涧，写下了这首诗情浓郁的小诗。此诗写的虽然是平常的景物，但经诗人的点染，却成了一幅意境幽深的有韵之画，还蕴含了诗人一种不在其位，不得其用的无奈与忧伤情怀，也就是作者对自己怀才不遇的不平。\n", 3, false);
        insertPoem(db, 3018, "大林寺桃花", "唐 白居易",
                "人间四月芳菲尽，\n山寺桃花始盛开。\n" +
                        "长恨春归无觅处，\n不知转入此中来。\n",
                "释义：\n" +
                        "⑴大林寺：在庐山大林峰，相传为晋代僧人昙诜所建，为中国佛教胜地之一。\t" +
                        "⑵人间：指庐山下的平地村落。芳菲：盛开的花，亦可泛指花，花草艳盛的阳春景色。尽：指花凋谢了。\t" +
                        "⑶山寺：指大林寺。始：才；刚刚。\t" +
                        "⑷长恨：常常惋惜。春归：春天回去了。觅：寻找。\t" +
                        "⑸不知：岂料，想不到。转：反。此中：这深山的寺庙里。\n " +
                        "译文：\n  在人间四月里百花凋零已尽，高山古寺中的桃花才刚刚盛开。\n" +
                        "我常为春光逝去无处寻觅而怅恨，却不知它已经转到这里来。\n" +
                        "整体赏析:\n" +
                        "《大林寺桃花》是唐代诗人白居易于元和十二年（817年）初夏在江州（今九江）庐山上大林寺时即景吟成的一首七绝。此诗说初夏四月作者来到大林寺，此时山下芳菲已尽，而不期在山寺中遇上了一片刚刚盛开的桃花。诗中写出了作者触目所见的感受，突出地展示了发现的惊讶与意外的欣喜。全诗把春光描写得生动具体，天真可爱，活灵活现；立意新颖，构思巧妙，趣味横生，是唐人绝句中一首珍品。\n", 3, true);

    }


    private static void insertGradeFourPoems(SQLiteDatabase db) {
        insertPoem(db, 4001, "鹿柴", "唐 王维",
                "空山不见人，\n" +
                        "但闻人语响2。\n" +
                        "返景入深林3，\n复照青苔上4。\n",
                "词句注释：\n" +
                        "1.鹿柴（zhài）：王维辋川别墅之一（在今陕西省蓝田县西南）。柴：通“寨”、“砦”，用树木围成的栅栏。\t" +
                        "2.但：只。\t" +
                        "3.返景（yǐng）：同“返影”，太阳将落时通过云彩反射的阳光。\t" +
                        "4.复：又。\n" +
                        "白话译文：\n" +
                        "山中空旷寂静看不见人，只听得说话的人语声响。\n" +
                        "夕阳的金光直射入深林，又照在幽暗处的青苔上。\n" +
                        "诗词赏析：\n" +
                        "《鹿柴》是唐代诗人王维的作品。这首诗写一座人迹罕至的空山，一片古木参天的树林，意在创造一个空寂幽深的境界。第一句先正面描写空山的杳无人迹，侧重于表现山的空寂清冷。之后紧接第二句境界顿出，以局部的、暂时的“响”反衬出全局的、长久的空寂。第三、第四句由上幅的描写空山传语进而描写深林返照，由声而色。\n",
                4, false);
        insertPoem(db, 4002, "暮江吟", "唐 白居易",
                "一道残阳铺水中⑵ ，\n半江瑟瑟半江红⑶ 。\n" +
                        "可怜九月初三夜⑷，\n露似真珠月似弓⑸。\n",
                "词句注释：\n" +
                        "⑴暮江吟：黄昏时分在江边所作的诗。吟，古代诗歌的一种形式。\t" +
                        "⑵残阳：快落山的太阳的光。也指晚霞。\t" +
                        "⑶瑟瑟：原意为碧色珍宝，此处指碧绿色 。\t" +
                        "⑷可怜：可爱。九月初三：农历九月初三的时候。\t" +
                        "⑸真珠：即珍珠。月似弓：农历九月初三，上弦月，其弯如弓。\n" +
                        "白话译文：\n" +
                        "一道残阳渐沉江中，半江碧绿半江艳红。\n" +
                        "最可爱的是那九月初三之夜，露珠亮似珍珠郎朗新月形如弯弓。\n" +
                        "诗词赏析：\n" +
                        "《暮江吟》是唐代诗人白居易创作的一首七绝。这是一首写景佳作。诗人选取了红日西沉到新月东升这一段时间里的两组景物进行描写，运用了新颖巧妙的比喻，创造出和谐、宁静的意境，通过吟咏表现出内心深处的情思和对大自然的热爱之情。全诗语言清丽流畅，格调清新，绘影绘色，细致真切，其写景之微妙，历来备受称道。\n",
                4, false);
        insertPoem(db, 4003, "题西林壁", "北宋 苏轼",
                "横看成岭侧成峰⑵，\n远近高低各不同⑶。\n" +
                        "不识庐山真面目⑷，\n只缘身在此山中⑸。\n",
                "词句注释：\n" +
                        "⑴题西林壁：写在西林寺的墙壁上。西林寺在庐山西麓。题：书写，题写。西林：西林寺，在江西庐山。\t" +
                        "⑵横看：从正面看。庐山总是南北走向，横看就是从东面西面看。侧：侧面。\t" +
                        "⑶各不同：各不相同。\t" +
                        "⑷不识：不能认识，辨别。真面目：指庐山真实的景色、形状。\t" +
                        "⑸缘：因为；由于。此山：这座山，指庐山。\n" +
                        "白话译文：\n" +
                        "从正面、侧面看庐山山岭连绵起伏、山峰耸立，从远处、近处、高处、低处看庐山，庐山呈现各种不同的样子。\n" +
                        "我之所以认不清庐山真正的面目，是因为我自身处在庐山之中。\n" +
                        "诗词赏析：\n" +
                        "《题西林壁》是宋代文学家苏轼的诗作。这是一首诗中有画的写景诗，又是一首哲理诗，哲理蕴含在对庐山景色的描绘之中。前两句描述了庐山不同的形态变化。庐山横看绵延逶迤，崇山峻岭郁郁葱葱连环不绝；侧看则峰峦起伏，奇峰突起，耸入云端。从远处和近处不同的方位看庐山，所看到的山色和气势又不相同。后两句写出了作者深思后的感悟：之所以从不同的方位看庐山，会有不同的印象，原来是因为“身在此山中”。也就是说，只有远离庐山，跳出庐山的遮蔽，才能全面把握庐山的真正仪态。全诗紧紧扣住游山谈出自己独特的感受，借助庐山的形象，用通俗的语言深入浅出地表达哲理，故而亲切自然，耐人寻味。\n",
                4, false);
        insertPoem(db, 4004, "雪梅", "南宋 卢钺（lú yuè）",
                "梅雪争春未肯降⑴，\n" +
                        "骚人阁笔费评章⑵。\n" +
                        "梅须逊雪三分白⑶，\n" +
                        "雪却输梅一段香⑷。\n",
                "词句注释：\n" +
                        "⑴降（xiáng），服输。\t" +
                        "⑵骚人：诗人。因诗人屈原代表作名《离骚》而借称。\t" +
                        "⑶阁笔：放下笔。阁，同“搁 ”，放下。评章：评议文章，这里指评议梅与雪的高下。\t" +
                        "⑷逊：差，不如。\t" +
                        "⑸一段香：一片香。\t" +
                        "⑹日暮：指太阳快落山的时候，傍晚。\t" +
                        "⑺十分春：全部的春天。\n" +
                        "白话译文：\n" +
                        "梅花和雪花都认为各自占尽了春色，谁也不肯服输。难坏了诗人，难写评判文章。说句公道话，梅花须逊让雪花三分晶莹洁白，雪花却输给梅花一段清香。\n" +
                        "诗词赏析：\n" +
                        "《雪梅二首》是南宋诗人卢梅坡创作的七言绝句组诗作品。这两首诗阐述了梅、雪、诗三者的关系，缺一不可，结合在一起，才能组成美丽的春色。第一首诗前两句写梅雪争春，要诗人评判，后两句是诗人对梅与雪的评语。第二首诗首句写梅与雪之间的关系，次句写雪与诗之间的关系。后两句写梅、雪与诗之间的关系，梅花开放而还没下雪，所以还缺乏诗意。两首诗写得妙趣横生，富有韵味。\n",
                4, false);
        insertPoem(db, 4005, "嫦娥", "唐 李商隐",
                "云母屏风烛影深⑵，\n长河渐落晓星沉⑶。\n" +
                        "嫦娥应悔偷灵药⑷，\n碧海青天夜夜心⑸。\n",
                "词句注释：\n" +
                        "⑴常娥：原作“姮娥”，今作“嫦娥”，神话中的月亮女神，传说是夏代东夷首领后羿的妻子。\t" +
                        "⑵云母屏风：以云母石制作的屏风。云母，一种矿物，板状，晶体透明有光泽，古代常用来装饰窗户、屏风等物。深：暗淡。\t" +
                        "⑶长河：银河。晓星：晨星。或谓指启明星，清晨时出现在东方。\t" +
                        "⑷灵药：指长生不死药。《淮南子·览冥训》载，后羿在西王母处求得不死的灵药，姮娥偷服后奔入月宫中。\t" +
                        "⑸碧海青天：指嫦娥的枯燥生活，只能见到碧色的海，深蓝色的天。碧海，形容蓝天苍碧如同大海。夜夜心：指嫦娥每晚都会感到孤单。\n" +
                        "白话译文：\n" +
                        "烛影深深映上云母屏风，银河渐渐沉没，晨星渐渐消失。\n" +
                        "嫦娥后悔寂寞，后悔偷吃灵药。面对碧海蓝天，日夜思念人间。\n" +
                        "诗词赏析：\n" +
                        "《常娥》是唐代诗人李商隐的作品。此诗咏叹常娥（即嫦娥）在月中的孤寂情景，抒发诗人自伤之情。前两句分别描写室内、室外的环境，渲染空寂清冷的气氛，表现主人公怀思的情绪；后两句是主人公在一宵痛苦的思忆之后产生的感想，表达了一种孤寂感。全诗情调感伤，意蕴丰富，奇思妙想，真实动人。\n",
                4, false);
        insertPoem(db, 4006, "出塞", "唐 王昌龄",
                "秦时明月汉时关，\n万里长征人未还。\n" +
                        "但使龙城飞将在，\n不教胡马度阴山。\n",
                "词句注释：\n" +
                        "1.但使：只要。\t" +
                        "2.“龙城飞将”，指汉武帝时期北伐匈奴的将领。龙城可能指奇袭龙城的西汉名将卫青，后来更多的是借代众多汉朝抗匈名将。" +
                        "《汉书·卫青霍去病传》载，元光六年（前129年），卫青为车骑将军，出上谷，至笼城，斩首虏数百人。" +
                        "笼城，颜师古注曰：“笼”与“龙”同。飞将一词在目前的留存的诗词中大部分都指代汉朝将领李广所以这里应该是指代李广。" +
                        "这里可以概括称汉武帝时期北伐匈奴的名将。\t" +
                        "3.不教：不叫，不让。教，让。\t" +
                        "4.胡马：指侵扰内地的外族骑兵。 \t" +
                        "5.度：越过。\t" +
                        "6.阴山：昆仑山的北支，起自河套西北，横贯绥远、察哈尔及热河北部，是中国北方的屏障。\t" +
                        "7.还：回来\n" +
                        "白话译文：\n" +
                        "秦汉以来，明月就是这样照耀着边塞，离家万里的士卒始终没能回还\n" +
                        "如果有卫青这样的将军立马阵前，一定不会让敌人的铁蹄跨过阴山\n" +
                        "诗词赏析：\n" +
                        "《出塞》是唐朝诗人王昌龄创作的一首七言绝句。此诗内容主要是慨叹远征之苦，良将之苦，体现出了诗人对家国的爱重和维护、对战争胜利的渴望与期盼以及对良将的信心。\n",
                4, false);
        insertPoem(db, 4007, "凉州词", "唐 王翰",
                "葡萄美酒夜光杯⑵，\n欲饮琵琶马上催⑶。\n" +
                        "醉卧沙场君莫笑⑷，\n古来征战几人回⑸。\n",
                "词句注释：\n" +
                        "⑴凉州词：唐乐府名。《乐苑》：“凉州宫词曲，开元中，西凉都督郭知运所进。”属《近代曲辞》，是《凉州曲》的唱词，盛唐时流行的一种曲调名。\t" +
                        "⑵夜光杯：用白玉制成的酒杯，光可照明，这里指华贵而精美的酒杯。据《海内十洲记》所载，为周穆王时西胡所献之宝。\t" +
                        "⑶欲：将要。琵琶：这里指作战时用来发出号角的声音时用的。催：催人出征；也有人解作鸣奏助兴。\t" +
                        "⑷沙场：平坦空旷的沙地，古时多指战场。君：你。\t" +
                        "⑸征战：打仗。\n" +
                        "白话译文：\n" +
                        "酒筵上甘醇的葡萄美酒盛满在精美的夜光杯之中，歌伎们弹奏起急促欢快的琵琶声助兴催饮，想到即将跨马奔赴沙场杀敌报国，战士们个个豪情满怀。\n" +
                        "今日一定要一醉方休，即使醉倒在战场上又何妨？此次出征为国效力，本来就打算马革裹尸，没有准备活着回来。\n" +
                        "诗词赏析：\n" +
                        "《凉州词二首》是唐代诗人王翰的组诗作品。第一首诗渲染了出征前盛大华贵的酒筵以及战士们痛快豪饮的场面，表现了战士们将生死置之度外的旷达、奔放的思想感情；第二首诗抓住边塞风光景物的特点，抒写边关将士们夜闻笳声而触动的思乡之情。这两首诗意境开阔，语言华美，节奏明快，富有浪漫气息。\n",
                4, false);
        insertPoem(db, 4008, "夏日绝句", "宋 李清照",
                "生当作人杰1，\n死亦为鬼雄2。\n" +
                        "至今思项羽3，\n不肯过江东4。\n",
                "词句注释：\n" +
                        "1.人杰：人中的豪杰。汉高祖曾称赞开国功臣张良、萧何、韩信是“人杰”。\t" +
                        "2.鬼雄：鬼中的英雄。屈原《国殇》：“身既死兮神以灵，子魂魄兮为鬼雄。”\t" +
                        "3.项羽：秦末时自立为西楚霸王，与刘邦争夺天下，在垓下之战中，兵败自杀。\t" +
                        "4.江东：项羽当初随叔父项梁起兵的地方。\n" +
                        "白话译文：\n" +
                        "生时应当作人中豪杰，死后也要做鬼中英雄。\n" +
                        "到今天人们还在怀念项羽，因为他不肯苟且偷生，退回江东。\n" +
                        "诗词赏析：\n" +
                        "《夏日绝句》是宋代词人李清照创作的一首五言绝句。这是一首借古讽今、抒发悲愤的怀古诗。诗的前两句，语出惊人，直抒胸臆，提出人“生当作人杰”，为国建功立业，报效朝廷；“死”也应该做“鬼雄”，方才不愧于顶天立地的好男儿。深深的爱国之情喷涌出来，震撼人心。最后两句，诗人通过歌颂项羽的悲壮之举来讽刺南宋当权者不思进取、苟且偷生的无耻行径。全诗只有短短的二十个字，却连用三个典故，可谓字字珠玑，字里行间透出一股正气。\n" +
                        "历史典故：\n" +
                        "第一个是人杰：人中的豪杰。汉高祖曾称赞开国功臣张良、萧何、韩信是“人杰”。\n" +
                        "第二个是鬼雄：鬼中的英雄。屈原《国殇》：“身既死兮神以灵，子魂魄兮为鬼雄。”\n" +
                        "最后一个就是项羽兵败，自刎乌江的典故 项羽（前232-前202）：秦末下相（今江苏宿迁）人。曾领导起义军消灭秦军主力，自立为西楚霸王。后被刘邦打得大败，突围至乌江（在今安徽和县），自刎而死追问谢谢回答啦，但我还是搞不清楚哦",
                4, false);
        insertPoem(db, 4009, "别董大", "唐 高适",
                "千里黄云白日曛，\n北风吹雁雪纷纷。\n" +
                        "莫愁前路无知己，\n天下谁人不识君？\n",
                "词句注释：\n" +
                        "⑴董大：指董庭兰，是当时有名的音乐家，在其兄弟中排名第一，故称“董大”。\t" +
                        "⑵黄云：天上的乌云，在阳光下，乌云是暗黄色，所以叫黄云。白日曛（xūn）：太阳黯淡无光。曛，即曛黄，指夕阳西沉时的昏黄景色。\t" +
                        "⑶谁人：哪个人。君：你，这里指董大。\n" +
                        "白话译文：\n" +
                        "千里黄云蔽天日色暗昏昏，北风吹着归雁大雪纷纷。\n" +
                        "不要担心前路茫茫没有知己，普天之下哪个不识君？\n" +
                        "诗词赏析：\n" +
                        "《别董大二首》是唐代诗人高适的组诗作品。这两首诗是高适与董大久别重逢，经过短暂的聚会以后，又各奔他方的赠别之作。作品勾勒了送别时晦暗寒冷的愁人景色，表现了作者当时处在困顿不达的境遇之中，但没有因此沮丧、沉沦，既表露出作者对友人远行的依依惜别之情，也展现出作者豪迈豁达的胸襟。\n",
                4, false);
        insertPoem(db, 4010, "宿新市徐公店", "南宋 杨万里",
                "篱落疏疏一径深\n，树头花落未成荫。\n" +
                        "儿童急走追黄蝶\n，飞入菜花无处寻。\n",
                "词句注释：\n" +
                        "⑴新市：地名。今浙江省德清县新市镇，一说在今湖北省京山县东北。徐公店：姓徐的人家开的酒店名。公：古代对男子的尊称。\t" +
                        "⑵篱落：篱笆。疏疏：稀疏，稀稀落落的样子。一径深：一条小路很远很远。深，深远。\t" +
                        "3.头：树枝头。花落：一作“新绿”。未成阴：新叶还没有长得茂盛浓密，未形成树阴。阴，树叶茂盛浓密。\t" +
                        "4.急走：奔跑着、快追。走，是跑的意思。\t" +
                        "5.无处：没有地方。寻：寻找。\n" +
                        "白话译文：\n" +
                        "在稀稀落落的篱笆旁，有一条小路伸向远方，路边的树上花已凋落，而新叶却刚刚长出没有形成树阴。一个孩子奔跑着追捕一只黄蝴蝶，可蝴蝶飞到菜花丛中后就再也找不到了。\n" +
                        "诗词赏析：\n" +
                        "诗选取篱落、菜花、儿童、黄蝶等意象，运用细节描写，表明诗人对田园情怀的敏感度。全诗语言清新，形象鲜明，富有情趣。\n",
                4, false);
        insertPoem(db, 4011, "四时田园杂兴（其二十五）", "南宋 范成大",
                "梅子金黄杏子肥，\n麦花雪白菜花稀。\n日长篱落无人过，\n惟有蜻蜓蛱蝶飞。\n",
                "词句注释：\n" +
                        "1. 梅子：果梅树的果实，夏季成熟。\t" +
                        "2.肥：指果肉肥厚。麦花：小麦、大麦花。\t" +
                        "3.麦花：小麦、大麦花。\t" +
                        "4.菜花：油菜花。\t" +
                        "5.日长：夏天已近，白天越来越长了。\t" +
                        "6.篱落：篱笆。\t" +
                        "7.惟有：只有。\t" +
                        "8.蛱（jiá）蝶：菜粉蝶。\n" +
                        "白话译文：\n" +
                        "一树树梅子变得金黄，杏子也越长越大了；\n" +
                        "荞麦花一片雪白，油菜花倒显得稀稀落落。\n" +
                        "白天长了，篱笆的影子随着太阳的升高变得越来越短，没有人经过；\n" +
                        "只有蝴蝶和蜻蜓绕着篱笆飞来飞去。\n" +
                        "诗词赏析：\n" +
                        "这首诗写初夏江南的田园景色。诗中用梅子黄、杏子肥、麦花白、菜花稀，写出了夏季南方农村景物的特点，" +
                        "有花有果，有色有形。前两句写出梅黄杏肥，麦白菜稀，色彩鲜丽。诗的第三句，从侧面写出了农民劳动的情况：" +
                        "初夏农事正忙，农民早出晚归，所以白天很少见到行人。最后一句又以“惟有蜻蜓蛱蝶飞”来衬托村中的寂静，静中有动，" +
                        "显得更静。后两句写出昼长人稀，蜓飞蝶舞。\n",
                4, false);
        insertPoem(db, 4012, "清平乐·村居", "南宋 辛弃疾",
                "茅檐低小⑵，\n溪上青青草。\n醉里吴音相媚好⑶，\n白发谁家翁媪⑷？\n" +
                        "大儿锄豆溪东⑸，\n中儿正织鸡笼⑹。\n最喜小儿亡赖⑺，\n溪头卧剥莲蓬⑻。\n",
                "词句注释：\n" +
                        "⑴清平乐（yuè）：原为唐教坊曲名，取用汉乐府“清乐”、“平乐”这两个乐调而命名。后用作词牌名。《宋史·乐志》入“大石调”，《金奁集》、《乐章集》并入“越调”。" +
                        "双调四十六字，八句，前片四仄韵，后片三平韵。\t" +
                        "⑵茅檐：茅屋的屋檐。\t" +
                        "⑶吴音：吴地的方言。作者当时住在信州（今上饶），这一带的方言为吴音。相媚好：指相互逗趣，取乐。\t" +
                        "⑷翁媪（ǎo）：老翁、老妇。\t" +
                        "⑸锄豆：锄掉豆田里的草。\t" +
                        "⑹织：编织，指编织鸡笼。\t" +
                        "⑺亡（wú）赖：《汉书·高帝纪》：“始大人常以臣亡赖，不能治产业，不如仲力。”注云：“江淮之间，谓小儿多诈狡狯为亡赖。”这里指小孩顽皮、淘气。亡，通“无”。\t" +
                        "⑻卧：趴。\n" +
                        "白话译文：\n" +
                        "草屋的茅檐又低又小，溪边长满了碧绿的小草。含有醉意的吴地方言，听起来温柔又美好，那满头白发的老人是谁家的呀？\n" +
                        "大儿子在溪东边的豆田锄草，二儿子正忙于编织鸡笼。最令人喜爱的是小儿子，他正横卧在溪头草丛，剥着刚摘下的莲蓬。\n" +
                        "诗词赏析：\n" +
                        "《清平乐·村居》是宋代大词人辛弃疾的词作。此词描绘了农村一个五口之家的环境和生活画面，借此表现人情之美和生活之趣。作者把这家老小的不同面貌和情态，以及他们的美好的农家生活描写得有声有色，惟妙惟肖，活灵活现，具有浓厚的生活气息，表现出作者对农村和平宁静生活的喜爱。全词以白描手法描述了农村的乡土风俗，呈现出一种清新宁馨的风格。\n",
                4, false);
        insertPoem(db, 4013, "卜算子·咏梅", "毛泽东",
                "风雨送春归，\n飞雪迎春到。\n已是悬崖百丈冰⑶，\n犹有花枝俏⑷。\n" +
                        "俏也不争春，\n只把春来报。\n待到山花烂漫时⑸，\n她在丛中笑⑹。\n",
                "词句注释：\n" +
                        "⑴卜算子：词牌名，又名“卜算子令”“百尺楼”“眉峰碧”“楚天遥”等，双调四十四字，上下片各两仄韵。\t" +
                        "⑵陆游咏梅词：指陆游的《卜算子·咏梅》。陆游创作有一百多首咏梅词，《卜算子·咏梅》是其最有名的一首。\t" +
                        "⑶百丈冰：形容极度寒冷。\t" +
                        "⑷犹：还，依然，仍然。俏：俊俏，美好的样子。\t" +
                        "⑸烂漫：颜色鲜明而美丽。\t" +
                        "⑹丛中笑：百花盛开时，感到欣慰和高兴。\n" +
                        "白话译文：\n" +
                        "春的风雨刚刚把春天送回来，转眼之间，冬末漫天飞舞的雪花又在迎接春天回来。已经是冰封雪冻最刺骨的时刻，悬崖边上还盛开着俏丽的梅花。\n" +
                        "梅花虽然美丽，但并不炫耀自己，只是为了向人们报告春天到来的消息。等到满山遍野开满鲜花之时，她却在花丛中欣慰地笑着。\n" +
                        "诗词赏析：\n" +
                        "《卜算子·咏梅》是毛泽东反用陆游同调同题词意而创作的一首词。此词塑造了梅花俊美而坚韧不拔的形象，鼓励人们要有威武不屈的精神和革命到底的乐观主义精神。上阕主要写梅花傲寒开放的美好身姿，描绘梅花的美丽、积极与坚贞；下阕主要写梅花的精神风貌，表现了梅花坚强不屈、不畏寒冷，对春天充满信心和谦虚的风格。全词运用逆向思维来立意，融合象征、拟人、衬托、比喻、夸张、对仗、顶针等手法，较完美地实现了托物言志的目的。\n",
                4, false);
        insertPoem(db, 4014, "蜂", "唐 罗隐",
                "不论平地与山尖，\n无限风光尽被占。\n" +
                        "采得百花成蜜后，\n为谁辛苦为谁甜。\n",
                "释义：\n⑴山尖：山峰。\t" +
                        "⑵无限风光：极其美好的风景。占：占有，占据。\t" +
                        "⑶采：采取，这里指采取花蜜。\n" +
                        "诗词赏析:\n" +
                        "不论平地与山尖，无限风光尽被占。无论是在平原还是在山野，到处都可以见到蜜蜂忙忙碌碌采蜜的身影。越是春光明媚、鲜花盛开的地方就越能吸引蜜蜂。这两句语气十分肯定，盛赞蜜蜂尽占美好的春光，表现了诗人对蜜蜂的羡慕与赞美之情。\n" +
                        "采得百花成蜜后，为谁辛苦为谁甜？这两句急转直下，由前面盛赞蜜蜂“占尽风光”转而咏叹它终生徒劳，所获甚少。采花、酿蜜本是蜜蜂的天职。" +
                        "它辛苦酿成的蜜主要是用来供养蜂王，或被人所用，自己享用的却很少，而这完全是出于它的本能，根本不会意识到这有什么不公平。" +
                        "可是诗人却从这里发现了问题，并替蜜蜂发出了“为谁辛苦为谁甜”的不平之鸣。\n",
                4, true);
        insertPoem(db, 4015, "独坐敬亭山", "唐 李白",
                "众鸟高飞尽⑵，\n孤云独去闲⑶。\n" +
                        "相看两不厌⑷，\n只有敬亭山。\n",
                "词句注释：\n" +
                        "⑴敬亭山：在今安徽宣城市北。《元和郡县志》记载：“在宣城县北十里。山有万松亭、虎窥泉。”" +
                        "《江南通志》卷一六宁国府：“敬亭山在府城北十里。府志云：古名昭亭，东临宛、句二水，南俯城闉，烟市风帆，" +
                        "极目如画。”\t" +
                        "⑵尽：没有了。\t" +
                        "⑶孤云：陶渊明《咏贫士诗》中有“孤云独无依”的句子。朱谏注：“言我独坐之时，鸟飞云散，有若无情而不相亲者。" +
                        "独有敬亭之山，长相看而不相厌也。” 独去闲：独去，独自去。 闲，形容云彩飘来飘去，悠闲自在的样子。" +
                        "孤单的云彩飘来飘去。\t" +
                        "⑷两不厌：指诗人和敬亭山而言。厌：满足。\n" +
                        "白话译文：\n" +
                        "群鸟高飞无影无踪，孤云独去自在悠闲。\n" +
                        "你看我，我看你，彼此之间两不相厌，只有我和眼前的敬亭山了。\n" +
                        "诗词赏析：\n" +
                        "《独坐敬亭山》是唐代伟大诗人李白创作的一首五绝，是诗人表现自己精神世界的佳作。此诗表面是写独游敬亭山的情趣，而其深含之意则是诗人生命历程中旷世的孤独感。诗人以奇特的想象力和巧妙的构思，赋予山水景物以生命，将敬亭山拟人化，写得十分生动。作者写的是自己的孤独和自己的怀才不遇，但更是自己的坚定，在大自然中寻求安慰和寄托。\n",
                4, false);
        insertPoem(db, 4016, "芙蓉楼送辛渐", "唐 王昌龄",
                "寒雨连江夜入吴⑵，\n平明送客楚山孤⑶。\n" +
                        "洛阳亲友如相问⑷，\n一片冰心在玉壶⑸。\n",
                "词句注释：\n" +
                        "⑴芙蓉楼：原名西北楼，登临可以俯瞰长江，遥望江北，在润州（今江苏省镇江市）西北。据《元和郡县志》卷二十六《江南道·润州》丹阳：“晋王恭为刺史，改创西南楼名万岁楼，西北楼名芙蓉楼。”一说此处指黔阳（今湖南黔城）芙蓉楼。辛渐：诗人的一位朋友。\t" +
                        "⑵寒雨：秋冬时节的冷雨。连江：雨水与江面连成一片，形容雨很大。吴：古代国名，这里泛指江苏南部、浙江北部一带。江苏镇江一带为三国时吴国所属。\t" +
                        "⑶平明：天亮的时候。客：指作者的好友辛渐。楚山：楚山：楚地的山。这里的楚也指镇江市一带，因为古代吴、楚先后统治过这里，所以吴、楚可以通称。孤：独自，孤单一人。\t" +
                        "⑷洛阳：现位于河南省西部、黄河南岸。\t" +
                        "⑸冰心，比喻纯洁的心。玉壶，道教概念妙真道教义，专指自然无为虚无之心。陆机《汉高祖功臣颂》有“心若怀冰”句，比喻心地纯洁。鲍照《代白头吟》：“直如朱丝绳，清如玉壶冰。”也是以“玉壶冰”比喻清白的操守。唐人有时也以此比喻为官廉洁，如姚崇《冰壶诫》序云“夫洞澈无瑕，澄空见底，当官明白者，有类是乎？故内怀冰清，外涵玉润，此君子冰壶之德也”。\n" +
                        "白话译文：\n" +
                        "冷雨洒满江天的夜晚，我来到吴地，天明送走好友后，只留下楚山的孤影。\n" +
                        "到了洛阳，如果有亲友向您打听我的情况，就请转告他们，我的心依然像玉壶里的冰一样纯洁，未受功名利禄等世情的玷污。\n" +
                        "诗词赏析：\n" +
                        "《芙蓉楼送辛渐二首》是唐代诗人王昌龄的组诗作品，作于作者被贬为江宁（今江苏南京）县丞时。第一首写的是第二天早晨作者在江边送别辛渐的情景；第二首写的是第一天晚上作者在芙蓉楼为辛渐饯别的情景。全诗即景生情，寓情于景，含蓄蕴藉，韵味无穷。\n",
                4, false);
        insertPoem(db, 4017, "塞下曲", "唐 卢纶",
                "月黑雁飞高，\n单于夜遁逃。\n欲将轻骑逐，\n大雪满弓刀。\n",
                "①塞下曲：古时边塞的一种军歌。\t" +
                        "②月黑：没有月光。\t" +
                        "③单于（chán yú ）：匈奴的首领。这里指入侵者的最高统帅。\t" +
                        "④遁：逃走。\t" +
                        "⑤将：率领。\t" +
                        "⑥轻骑：轻装快速的骑兵。\t" +
                        "⑦逐：追赶。\t" +
                        "⑧满：沾满。\n" +
                        "译文：\n" +
                        "暗淡的月夜里，一群大雁惊叫着高飞而起，暴露了单于的军队想要趁夜色潜逃的阴谋。将军率领轻骑兵一路追杀，顾不得漫天的大雪已落满弓和刀。\n" +
                        "诗词赏析：\n" +
                        "《塞下曲·月黑雁飞高》是唐代诗人卢纶创作的一首古体诗，是组诗《塞下曲》中的第三首。这首诗写将军雪夜准备率兵追敌的壮举，气概豪迈。诗句虽然没有直接写激烈的战斗场面，但留给了读者广阔的想象空间，营造了诗歌意蕴悠长的氛围。",
                4, true);
        insertPoem(db, 4018, "墨梅", "吴 王冕",
                "我家洗砚池头树，\n朵朵花开淡墨痕。\n" +
                        "不要人夸好颜色，\n只留清气满乾坤。\n",
                "白话译文：\n" +
                        "洗砚池边生长的一棵梅花，朵朵梅花都似乎是洗笔后淡墨留下的痕迹而没有鲜艳的颜色。\n" +
                        "它并不需要别人去夸许它的颜色，在意的只是要把清淡的香气充满在天地之间。\n" +
                        "诗词赏析：\n" +
                        "《墨梅》是元代诗人王冕创作的一首七言绝句。此诗开头两句直接描写墨梅，最后两句盛赞墨梅的高风亮节，赞美墨梅不求人夸，只愿给人间留下清香的美德，实际上是借梅自喻，表达自己对人生的态度以及不向世俗献媚的高尚情操。全诗构思精巧、淡中有味，直中有曲，极富清新高雅之气。\n",
                4, false);
    }

    private static void insertGradeFivePoems(SQLiteDatabase db) {
        insertPoem(db, 5001, "蝉", "唐 虞世南",
                "垂緌饮清露，\n流响出疏桐。\n" +
                        "居高声自远，\n非是藉秋风。\n",
                "词句注释：\n" +
                        "1.垂緌（ruí）：古代官帽打结下垂的部分，蝉的头部有伸出的触须，形状好像下垂的冠缨。也指蝉的下巴上与帽带相似的细嘴。清露：清纯的露水。饮清露：古人认为蝉生性高洁，栖高饮露，其实是刺吸植物的汁液。\n" +
                        "2.流：发出。流响：指蝉长鸣不已，声音传的很远。疏桐：高大的梧桐。\n" +
                        "3.居高：指栖息在高处，语意双关。\n" +
                        "4.藉（jiè）：凭借、依赖。\n" +
                        "白话译文：\n" +
                        "萧疏梧桐之上，蝉儿低饮清露，蝉声清脆响亮，回荡树林之间。\n" +
                        "身居高枝之上，可以傲视群虫，不用借助秋风，传声依然遥远。\n" +
                        "诗词赏析：\n" +
                        "《蝉》是唐代诗人虞世南创作的一首五言古诗，是首托物寓意的诗。作者托物寓意，一、二句以蝉的栖高饮露、蝉声远传暗喻人的清朗俊秀、高标逸韵；三、四句分别用一“自”字、“非”字，正反相生，充满张力，表达出对人的内在品格的热情赞美和高度自信。全诗简练传神，比兴巧妙，以秋蝉高洁傲世的品格自况，耐人寻味。\n",
                5, false);
        insertPoem(db, 5002, "乞巧", "唐 林杰",
                "七夕今宵看碧霄②，\n牵牛织女渡河桥。\n" +
                        "家家乞巧望秋月，\n穿尽红丝几万条③。\n",
                "词句注释：\n" +
                        "①乞巧：古代节日，在农历七月初七日，又名七夕。\t" +
                        "②碧霄：指浩瀚无际的青天。\t" +
                        "③几万条：比喻多。\n" +
                        "白话译文：\n" +
                        "七夕晚上，望着碧蓝的天空，就好像看见隔着“天河”的牛郎织女在鹊桥上相会。家家户户都在一边观赏秋月，一边乞巧（对月穿针），穿过的红线都有几万条了。\n" +
                        "诗词赏析：\n" +
                        "《乞巧》是唐朝诗人林杰的诗，诗人在诗中并没有具体写出各种不同的心愿，而是留下想象的空间，表达了人们乞取智巧、追求幸福的心愿。\n",
                5, false);
        insertPoem(db, 5003, "示儿", "南宋 陆游",
                "死去元知万事空，\n但悲不见九州同。\n" +
                        "王师北定中原日，\n家祭无忘告乃翁。\n",
                "词句注释：\n" +
                        "1.示儿：写给儿子们看。\t" +
                        "2.元知：原本知道。元，通“原”。本来。在苏教版等大部分教材中本诗第一句为“死去元知万事空”，但在老的人教版等教材中为“死去原知万事空”，因为是通假字，所以并不影响本诗的意境，尚有争议。人教版等教材多为“元”，不常用通假字。万事空：什么也没有了。\t" +
                        "3.但：只是。悲：悲伤九州：这里代指宋代的中国。古代中国分为九州，所以常用九州指代中国。同：统一。\t" +
                        "4.王师：指南宋朝廷的军队。北定：将北方平定。中原：指淮河以北被金人侵占的地区。\t" +
                        "5.家祭：祭祀家中先人。无忘：不要忘记。乃翁：你的父亲，指陆游自己。\n" +
                        "白话译文：\n" +
                        "我本来知道，当我死后，人间的一切就都和我无关了；唯一使我痛心的，就是我没能亲眼看到祖国的统一。\n" +
                        "因此，当朝廷军队收复中原失地的那一天到来之时，你们举行家祭，千万别忘把这好消息告诉你们的父亲！\n" +
                        "诗词赏析：\n" +
                        "《示儿》诗为陆游的绝笔，作于宋宁宗嘉定二年十二月（公元1210年元月）。此时陆游八十五岁，一病不起，在临终前，给儿子们写下了这首诗。这既是诗人的遗嘱，也是诗人发出的最后的抗战号召。\n",
                5, false);
        insertPoem(db, 5004, "题临安邸", "南宋 林升",
                "山外青山楼外楼，\n西湖歌舞几时休⑵？\n" +
                        "暖风熏得游人醉⑶，\n直把杭州作汴州⑷。\n",
                "词句注释：\n" +
                        "⑴临安：南宋的都城，今浙江省杭州市。金人攻陷北宋首都汴京后，南宋统治者逃亡到南方，建都于临安。邸（dǐ）：旅店。\t" +
                        "⑵西湖：在浙江杭州城西。汉时称明圣湖、唐后始称西湖，为著名游览胜地。几时休：什么时候停止。\t" +
                        "⑶熏（xūn）：吹，用于温暖馥郁的风。\t" +
                        "⑷直：简直。汴州：即汴京，北宋的都城，今河南省开封市。\n" +
                        "白话译文：\n" +
                        "青山无尽楼阁连绵望不见头，西湖上的歌舞几时才能停休？\n" +
                        "暖洋洋的春风吹得贵人如醉，简直是把杭州当成了那汴州。\n" +
                        "诗词赏析：\n" +
                        "《题临安邸》是宋代诗人林升创作的一首七绝。此诗第一句点出临安城青山重重叠叠、楼台鳞次栉比的特征，第二句用反问语气点出西湖边轻歌曼舞无休无止。后两句以讽刺的语言写出当政者纵情声色，并通过“杭州”与“汴州”的对照，不露声色地揭露了“游人们”的腐朽本质，也由此表现出作者对当政者不思收复失地的愤激以及对国家命运的担忧。" +
                        "全诗构思巧妙，措词精当，冷言冷语的讽刺，偏从热闹的场面写起；愤慨已极，却不作谩骂之语：确实是讽喻诗中的杰作。\n",
                5, false);
        insertPoem(db, 5005, "己亥杂诗[jǐ hài zá shī]", "清 龚自珍",
                "九州生气恃风雷，\n万马齐喑究可哀。\n" +
                        "我劝天公重抖擞，\n不拘一格降人才。\n",
                        "白话译文：\n" +
                        "九州内生机勃勃要有风雷激荡，万马齐喑的沉闷局面实在可哀。我劝告天公要重新把精神振作，打破一切清规戒律去选用人才\n" +
                        "诗词赏析：\n" +
                        "这是一首出色的政治诗。全诗层次清晰，共分三个层次：第一层，写了万马齐喑，朝野噤声的死气沉沉的现实社会。\n" +
                        "第二层，作者指出了要改变这种沉闷，腐朽的现状，就必须依靠风雷激荡般的巨大力量。暗喻必须经历波澜壮阔的社会变革才能使中国变得生机勃勃。\n" +
                        "第三层，作者认为这样的力量来源于人材，而朝庭所应该做的就是破格荐用人材，只有这样，中国才有希望。诗中选用“九州”、“风雷”、“万马”、“天公”这样的具有壮伟特征的主观意象，寓意深刻，气势磅礴。\n" +
                        "诗的前两句用了两个比喻，写出了诗人对当时中国形势的看法。“万马齐喑”比喻在腐朽、残酷的反动统治下，思想被禁锢，人才被扼杀，到处是昏沉、庸俗、愚昧，一片死寂、令人窒息的现实状况。“风雷”比喻新兴的社会力量，比喻尖锐猛烈的改革。从大处着眼、整体着眼、大气磅礴、雄浑深邃的艺术境界。\n" +
                        "诗的后两句，“我劝天公重抖擞，不拘一格降人才”是传诵的名句。诗人用奇特的想象表现了他热烈的希望，他期待着优秀杰出人物的涌现，期待着改革大势形成新的“风雷”、新的生机，一扫笼罩九州的沉闷和迟滞的局面，既揭露矛盾、批判现实，更憧憬未来、充满理想。它独辟奇境，别开生面，呼唤着变革，呼唤未来。\n",
                5, false);
        insertPoem(db, 5006, "山居秋暝", "唐 王维",
                "空山新雨后⑵，\n天气晚来秋。\n" +
                        "明月松间照，\n清泉石上流⑶。\n" +
                        "竹喧归浣女⑷，\n莲动下渔舟。\n" +
                        "随意春芳歇⑸，\n王孙自可留⑹。\n",
                "词句注释：\n" +
                        "⑴暝（míng）：日落，天色将晚。\t" +
                        "⑵空山：空旷，空寂的山野。新：刚刚。\t" +
                        "⑶清泉石上流：写的正是雨后的景色。\t" +
                        "⑷竹喧：竹林中笑语喧哗。喧：喧哗，这里指竹叶发出沙沙声响。浣（huàn）女：洗衣服的姑娘。浣：洗涤衣物。\t" +
                        "⑸随意：任凭。春芳：春天的花草。歇：消散，消失。\t" +
                        "⑹王孙：原指贵族子弟，后来也泛指隐居的人。留：居。此句反用淮南小山《招隐士》：“王孙兮归来，山中兮不可久留”的意思，王孙实亦自指。反映出无可无不可的襟怀。\n" +
                        "白话译文：\n" +
                        "空旷的群山沐浴了一场新雨，夜晚降临使人感到已是初秋。\n" +
                        "皎皎明月从松隙间洒下清光，清清泉水在山石上淙淙淌流。\n" +
                        "竹林喧响知是洗衣姑娘归来，莲叶轻摇想是上游荡下轻舟。\n" +
                        "春日的芳菲不妨任随它消歇，秋天的山中王孙自可以久留。\n" +
                        "诗词赏析：\n" +
                        "《山居秋暝》是唐代诗人王维的作品。此诗描绘了秋雨初晴后傍晚时分山村的旖旎风光和山居村民的淳朴风尚，表现了诗人寄情山水田园并对隐居生活怡然自得的满足心情，以自然美来表现人格美和社会美。全诗将空山雨后的秋凉，松间明月的光照，石上清泉的声音以及浣女归来竹林中的喧笑声，渔船穿过荷花的动态，和谐完美地融合在一起，给人一种丰富新鲜的感受。它像一幅清新秀丽的山水画，又像一支恬静优美的抒情乐曲，体现了王维诗中有画的创作特点\n",
                5, false);
        insertPoem(db, 5007, "枫桥夜泊", "唐 张继",
                "月落乌啼霜满天⑵，\n江枫渔火对愁眠⑶。\n" +
                        "姑苏城外寒山寺⑷，\n夜半钟声到客船⑸。\n",
                "词句注释：\n" +
                        "⑴枫桥：在今江苏省苏州市虎丘区枫桥街道阊门外。有人说“枫江古为封江”、“枫桥旧作封桥”（宋周遵道《豹隐纪谈》），也有人说，“旧把此桥误作封桥，到王珪才改正为枫桥”（《吴郡图经续记》），" +
                        "还有人说，“本为封江、封桥，王蚌改封为枫，人们震慑权势，只得趋附”。夜泊：夜间把船停靠在岸边。\t" +
                        "⑵乌啼：一说为乌鸦啼鸣，一说为乌啼镇。霜满天：霜，不可能满天，这个“霜”字应当体会作严寒；霜满天，是空气极冷的形象语。\t" +
                        "⑶江枫：一般解释作“江边枫树”，江指吴淞江，源自太湖，流经上海，汇入长江，俗称苏州河。另外有人认为指“江村桥”和“枫桥”。“枫桥”在吴县南门（阊阖门）外西郊，" +
                        "本名“封桥”，因张继此诗而改为“枫桥”。柯继承等指出，“唐以前早先枫桥称作封桥，吴语封、枫同音，以封桥误为枫桥，因河边有经霜红叶树之故。根据张诗所表明的物候及月相分析推算，" +
                        "张诗当作于农历十月深秋时分，江南水边多植乌桕之类树木，经霜叶红，古人诗中多混作为‘枫’。故江枫，是泛指江边的红叶类树，不必是枫。" +
                        "”渔火：通常解释，“鱼火”就是渔船上的灯火；也有说法指“渔火”实际上就是一同打渔的伙伴。《全唐诗》“渔火”作“渔父”。对愁眠：伴愁眠之意，此句把江枫和渔火二词拟人化。就是后世有不解诗的人，怀疑江枫渔火怎么能对愁眠，于是附会出一种讲法，说愁眠是寒山寺对面的山名。\t" +
                        "⑷姑苏：苏州的别称，因城西南有姑苏山而得名。寒山寺：在枫桥附近，始建于南朝梁代。相传因唐代僧人寒山、拾得曾住此而得名。在今苏州市西枫桥镇。本名“妙利普明塔院”，又名枫桥寺；另一种说法，“寒山”乃泛指肃寒之山，非寺名。寺曾经数次重建，现在的寺宇，为太平天国以后新建。" +
                        "寺钟在第二次世界大战时，被日本人运走，下落不明。\t" +
                        "⑸夜半钟声：当今的佛寺（春节）半夜敲钟，但当时有半夜敲钟的习惯，也叫“无常钟”或“分夜钟”。宋代文学家欧阳修曾提出疑问表示：“诗人为了贪求好句，以至于道理说不通，这是作文章的毛病，如张继诗句‘夜半钟声到客船’，句子虽好，但那有三更半夜打钟的道理？”可是经过许多人的实地查访，才知苏州和邻近地区的佛寺，有打半夜钟的风俗。\n" +
                        "白话译文：\n" +
                        "月亮已落下乌鸦啼叫寒气满天，对着江边枫树和渔火忧愁而眠。\n" +
                        "姑苏城外那寂寞清静寒山古寺，半夜里敲钟的声音传到了客船。\n" +
                        "诗词赏析：\n" +
                        "《枫桥夜泊》是唐代诗人张继的作品。唐朝安史之乱后，张继途经寒山寺时写下这首羁旅诗。此诗精确而细腻地描述了一个客船夜泊者对江南深秋夜景的观察和感受，勾画了月落乌啼、霜天寒夜、江枫渔火、孤舟客子等景象，有景有情有声有色。此外，这首诗也将作者羁旅之思，家国之忧，以及身处乱世尚无归宿的顾虑充分地表现出来，是写愁的代表作。" +
                        "全诗句句形象鲜明，可感可画，句与句之间逻辑关系又非常清晰合理，内容晓畅易解。\n",
                5, false);
        insertPoem(db, 5008, "长相思", "清 纳兰性德",
                "山一程，水一程，\n" +
                        "身向榆关那畔行，\n夜深千帐灯。\n" +
                        "风一更，雪一更，\n" +
                        "聒碎乡心梦不成，\n故园无此声。\n",
                "词句注释：\n" +
                        "1.长相思：词牌名，又名“吴山青”“山渐青”“相思令”“长思仙”“越山青”等。双调三十六字，前后段各四句三平韵一叠韵。\t" +
                        "2.山一程，水一程：即山长水远。程：道路、路程。\t" +
                        "3.榆（yú）关：即今山海关，在今河北秦皇岛东北。\t" +
                        "4.那畔：即山海关的另一边，指身处关外。\t" +
                        "5.千帐灯：皇帝出巡临时住宿的行帐的灯火，千帐言军营之多。\t" +
                        "6.风一更，雪一更：即言整夜风雪交加也。更：旧时一夜分五更，每更大约两小时。\t" +
                        "7.聒（guō）：声音嘈杂，这里指风雪声。\t" +
                        "8.故园：故乡，这里指北京。\t" +
                        "9.此声：指风雪交加的声音。\n" +
                        "白话译文：\n" +
                        "跋山涉水走过一程又一程，将士们马不停蹄地向着山海关进发，夜已经深了，千万个帐篷里都点起了灯。\n" +
                        "外面风声不断，雪花不住，扰得思乡的将士们无法入睡，在我温暖宁静的故乡，没有这般寒风呼啸、雪花乱舞的聒噪之声。\n" +
                        "诗词赏析：\n" +
                        "《长相思·山一程》是清代词人纳兰性德于康熙二十一年（1682年）创作的一首词。词作上片描写跋涉行军与途中驻扎，夹杂着颇多无奈情绪；" +
                        "下片叙述夜来风雪交加，搅碎了乡梦，倍觉惆怅。全词描写将士在外对故乡的思念，抒发了情思深苦的绵长心情。语言淳朴而意味深长，取景宏阔而对照鲜明。\n",
                5, false);
        insertPoem(db, 5009, "渔歌子", "唐 张志和",
                "西塞山前白鹭飞，\n桃花流水鳜鱼肥。\n" +
                        "青箬笠，绿蓑衣，\n斜风细雨不须归。\n",
                "词句注释：\n" +
                        "1.渔歌子：原是曲调名，后来人们根据它填词，又成为词牌名。\t" +
                        "2.西塞山：在今浙江省湖州市西面。\t" +
                        "3.白鹭：一种白色的水鸟。\t" +
                        "4.桃花流水：桃花盛开的季节正是春水盛涨的时候，俗称桃花汛或桃花水。鳜鱼：俗称“花鱼”、“桂鱼”。扁平、口大、鳞细、黄绿色，味道鲜美。\t" +
                        "5.箬笠：用竹篾、箬叶编的斗笠。\t" +
                        "6.蓑衣：用草或棕麻编织的雨衣。\n" +
                        "白话译文：\n" +
                        "西塞山前白鹭在自由地飞翔，江岸桃花盛开，春水初涨，水中鳜鱼肥美。渔翁头戴青色的箬笠，身披绿色的蓑衣，冒着斜风细雨，乐然垂钓，用不着回家。\n" +
                        "诗词赏析：\n" +
                        "《渔歌子·西塞山前白鹭飞》是唐代诗人张志和的一首词。这首词开头两句写垂钓的地方和季节。这两句里，出现了山、水、鸟、花、鱼，勾勒了一个垂钓的优美环境，为人物出场作好了铺垫。词的后两句写烟波上垂钓。尾句里的“斜风细雨”既是实写景物，又另含深意。这首词通过对自然风光和渔人垂钓的赞美，表现了作者向往自由生活的心情。\n",
                5, false);
        insertPoem(db, 5010, "观书有感（其一）", "南宋 朱熹",
                "半亩方塘一鉴开，\n天光云影共徘徊。\n" +
                        "问渠那得清如许？\n为有源头活水来。\n",
                "词句注释：\n" +
                        "1.方塘：又称半亩塘，在福建尤溪城南郑义斋馆舍（后为南溪书院）内。朱熹父亲朱松与郑交好，故尝有《蝶恋花·醉宿郑氏别墅》词云：“清晓方塘开一境。落絮如飞，肯向春风定。”鉴：一说为古代用来盛水或冰的青铜大盆。镜子；也有学者认为镜子。指像鉴（镜子）一样可以照人。\t" +
                        "2.“天光”句：是说天的光和云的影子反映在塘水之中，不停地变动，犹如人在徘徊。徘徊，来回移动。\t" +
                        "3.渠：它，第三人称代词，这里指方塘之水。那得：怎么会。那：同“哪”，怎么的意思。清：清澈。如许：如此，这样。\t" +
                        "4.为：因为。源头活水：比喻知识是不断更新和发展的，从而不断积累，只有在人生的学习中不断地学习、运用和探索，才能使自己永保先进和活力，就像水源头一样。\n" +
                        "白话译文：\n" +
                        "半亩大的方形池塘像一面镜子一样展现在眼前，天空的光彩和浮云的影子都在镜子中一起移动。\n" +
                        "要问为什么那方塘的水会这样清澈呢？是因为有那永不枯竭的源头为它源源不断地输送活水啊。\n" +
                        "诗词赏析：\n" +
                        "《观书有感二首》是宋代学者朱熹的组诗作品。这两首诗是描绘其“观书”的感受，借助生动的形象揭示深刻的哲理。第一首诗借助池塘水清因有活水注入的现象，比喻要不断接受新事物，才能保持思想的活跃与进步。\n",
                5, false);
        insertPoem(db, 5011, "观书有感（其二）", "南宋 朱熹",
                "昨夜江边春水生，\n艨艟巨舰一毛轻。\n" +
                        "向来枉费推移力，\n此日中流自在行。\n",
                "词句注释：\n" +
                        "1.艨艟（méng chōng）：一说“蒙冲”，原为古代攻击性很强的战舰名，这里指大船。一毛轻：像一片羽毛一般轻盈。 [2] \t" +
                        "2.向来：原先，指春水上涨之前。推移力：指浅水时行船困难，需人推挽而行。\t" +
                        "3.中流：河流的中心。\n" +
                        "白话译文：\n" +
                        "昨天夜里江边涨起了阵阵春潮，巨大的舰船轻盈得如同一片羽毛。\n" +
                        "向来行驶要白费很多推拉力气，今天却能在江水中央自在地顺漂。\n" +
                        "诗词赏析：\n" +
                        "《观书有感二首》是宋代学者朱熹的组诗作品。第二首诗借助巨舰无人能推动却能自由航行在水中，比喻艺术创作需要灵感的道理。全诗寓哲理于生动形象的比喻之中，不堕理障，富于理趣，一直为人传诵。\n",
                5, false);
        insertPoem(db, 5012, "四时田园杂兴（其三十一）", "南宋 范成大",
                "昼出耘田夜绩麻，\n村庄儿女各当家。\n" +
                        "童孙未解供耕织，\n也傍桑阴学种瓜。\n",
                "词句注释：\n" +
                        "1.耘田：除草。\t" +
                        "2.绩麻：把麻搓成线。\t" +
                        "3.各当家：每人担任一定的工作。\t" +
                        "4.未解：不懂。\t" +
                        "5.供：从事，参加。\t" +
                        "6.傍：靠近。\t" +
                        "7.阴；树荫。\n" +
                        "白话译文：\n" +
                        "白天去田里锄草，夜晚在家中搓麻线，村中男男女女各有各的家务劳动。\n" +
                        "小孩子虽然不会耕田织布，也在那桑树荫下学着种瓜。\n" +
                        "诗词赏析：\n" +
                        "诗人用清新的笔调，对农村初夏时的紧张劳动气氛，作了较为细腻的描写，读来意趣横生.与尤袤、陆游和杨万里并称“南宋四大诗人”。他的词，所涉及的生活面不及诗歌广阔；文字精美，音节谐婉，与婉约派一脉相通。\n",
                5, false);
        insertPoem(db, 5013, "稚子弄冰", "南宋 杨万里",
                "稚子金盆脱晓冰②，\n彩丝穿取当银钲③。\n" +
                        "敲成玉磬④穿林响，\n忽作玻璃⑤碎地声。\n",
                "词句注释：\n" +
                        "①稚子：指幼稚、天真的孩子。\t" +
                        "②脱晓冰：在这里指儿童晨起，从结成坚冰的铜盆里剜冰。\t" +
                        "③钲：指古代的一种像锣的乐器。\t" +
                        "④磬（qìng）：四声 古代打击乐器，形状像曲尺，用玉、石制成，可以悬挂在墙上。\t" +
                        "⑤玻璃：指古时候的一种天然玉石，也叫水玉，并不是现在的玻璃。\n" +
                        "白话译文：\n" +
                        "清晨，满脸稚气的小孩，将夜间冻结在盘中的冰块脱下，用彩线穿起来当做一种打击乐器。\n" +
                        "提在手中，轻轻敲打，冰块发出穿林而过的响声，当欣赏者正醉心于那穿林而过的响声时，忽然却听到了另一种声音--冰块落地，发出了水玉破碎的声音。\n" +
                        "诗词赏析：\n" +
                        "《稚子弄冰》是南宋诗人杨万里所作。全诗四句，从小孩幼稚嗜玩的心理特征切入，为读者描绘了一幅稚气满纸而又诗意盎然的“脱冰作戏”的场景。\n",
                5, false);
        insertPoem(db, 5014, "村晚", "南宋 雷震",
                "草满池塘水满陂⑴，\n山衔落日浸寒漪⑵。\n" +
                        "牧童归去横牛背⑶，\n短笛无腔信口吹⑷。\n",
                "词句注释：\n" +
                        "⑴陂（bēi）：水岸。\t" +
                        "⑵衔：口里含着。此指落日西沉，半挂在山腰，像被山咬住了。浸：淹没。寒漪：带有凉意的水纹。漪（yī），水波。\t" +
                        "⑶横牛背：横坐在牛背上。\t" +
                        "⑷腔：曲调。信口：随口。\n" +
                        "白话译文：\n" +
                        "绿草长满了池塘，池塘里的水呢，几乎溢出了塘岸。远远的青山，衔着彤红的落日，一起把影子倒映在水中，闪动着粼粼波光。\n" +
                        "那小牧童横骑在牛背上，缓缓地把家还；拿着一支短笛，随口吹着，也没有固定的声腔。\n" +
                        "诗词赏析：\n" +
                        "《村晚》是南宋诗人雷震创作的一首七言绝句。这是一首描写农村晚景的诗：形象描绘了一幅有着四周长满青草的池塘、似被山咬住的红红落日以及放牛回家的孩子横坐在牛背，用短笛随便地吹奏着不成调的曲子。诗人即景而写，构成了一幅饶有生活情趣的农村晚景图，抒发了诗人对乡村晚景的喜爱和赞美之情\n",
                5, false);
        insertPoem(db, 5015, "鸟鸣涧", "唐 王维",
                "人闲桂花落⑵，\n夜静春山空⑶。\n" +
                        "月出惊山鸟⑷，\n时鸣春涧中⑸。\n",
                "词句注释：\n" +
                        "⑴鸟鸣涧：鸟儿在山涧中鸣叫。\t" +
                        "⑵人闲：指没有人事活动相扰。闲：安静、悠闲，含有人声寂静的意思。桂花：此指木樨，有春花、秋花等不同品种，这里写的是春天开花的一种。\t" +
                        "⑶春山：春日的山。亦指春日山中。空：空寂、空空荡荡。空虚。这时形容山中寂静，无声，好像空无所有。\t" +
                        "⑷月出：月亮升起。惊：惊动，扰乱。山鸟：山中的鸟。\t" +
                        "⑸时鸣：偶尔（时而）啼叫。时：时而，偶尔。\n" +
                        "白话译文：\n" +
                        "很少有人活动只有桂花无声地飘落，夜里一片静谧春日的山谷寂寂空空。\n" +
                        "明月升起光辉照耀惊动了山中栖鸟，不时地高飞鸣叫在这春天的溪涧中。\n" +
                        "诗词赏析：\n" +
                        "《鸟鸣涧》是唐代诗人王维所作组诗《皇甫岳云溪杂题五首》的第一首。此诗描绘山间春夜中幽静而美丽的景色，侧重于表现夜间春山的宁静幽美。全诗紧扣一“静”字着笔，极似一幅风景写生画。诗人用花落、月出、鸟鸣等活动着的景物，突出地显示了月夜春山的幽静，取得了以动衬静的艺术效果，生动地勾勒出一幅“鸟鸣山更幽”的诗情画意图。全诗旨在写静，却以动景处理，这种反衬的手法极见诗人的禅心与禅趣。\n",
                5, false);
        insertPoem(db, 5016, "凉州词", "唐 王之涣",
                "黄河远上白云间⑵，\n一片孤城万仞山⑶。\n" +
                        "羌笛何须怨杨柳⑷，\n春风不度玉门关⑸。\n",
                "词句注释：\n" +
                        "⑴凉州词：又名《出塞》。为当时流行的一首曲子《凉州》配的唱词。郭茂倩《乐府诗集》卷七十九《近代曲词》载有《凉州歌》，并引《乐苑》云：“《凉州》，宫调曲，开元中西凉府都督郭知运进。”凉州，属唐陇右道，治所在姑臧县（今甘肃省武威市凉州区）。\t" +
                        "⑵远上：远远向西望去。黄河远上：远望黄河的源头。“河”一作“沙”，“远”一作“直”。\t" +
                        "⑶孤城：指孤零零的戍边的城堡。仞：古代的长度单位，一仞相当于七尺或八尺（约等于213厘米或264厘米）。\t" +
                        "⑷羌笛：属横吹式管乐。羌笛在汉代就已经传入甘肃、四川等地了，是唐代边塞上常见的一种乐器。何须：何必。杨柳：《折杨柳》曲。古诗文中常以杨柳喻送别情事。\t" +
                        "⑸度：吹到过。玉门关：汉武帝置，因西域输入玉石取道于此而得名。故址在今甘肃敦煌西北小方盘城，是古代通往西域的要道。六朝时关址东移至今安西双塔堡附近。\n" +
                        "白话译文：\n" +
                        "纵目望去，黄河渐行渐远，好像奔流在缭绕的白云中间，就在黄河上游的万仞高山之中，一座孤城玉门关耸峙在那里，显得孤峭冷寂。\n" +
                        "何必用羌笛吹起那哀怨的杨柳曲去埋怨春光迟迟不来呢，原来玉门关一带春风是吹不到的啊！\n" +
                        "诗词赏析：\n" +
                        "《凉州词二首》是唐代诗人王之涣的组诗作品。第一首诗以一种特殊的视角描绘了黄河远眺的特殊感受，同时也展示了边塞地区壮阔、荒凉的景色，悲壮苍凉，流落出一股慷慨之气，边塞的酷寒正体现了戍守边防的征人回不了故乡的哀怨，这种哀怨不消沉，而是壮烈广阔。\n",
                5, false);
        insertPoem(db, 5017, "送元二使安西", "唐 王维",
                "渭城朝雨浥轻尘⑵，客舍青青柳色新⑶。\n" +
                        "劝君更尽一杯酒⑷，西出阳关无故人⑸。\n",
                "词句注释：\n" +
                        "⑴渭城：在今陕西省西安市西北，渭水北岸。即秦代咸阳古城。\t" +
                        "⑵朝雨：早晨下的雨。浥（yì）：润湿。\t" +
                        "⑶客舍：驿馆，旅馆。柳色：柳树象征离别。\t" +
                        "⑷更尽：再喝干，再喝完。\t" +
                        "⑸阳关：在今甘肃省敦煌西南，为古代通西域的要道。故人：老朋友。\n" +
                        "白话译文：\n" +
                        "渭城早晨一场春雨沾湿了轻尘，客舍周围青青的柳树格外清新。\n" +
                        "老朋友请你再干一杯饯别酒吧，出了阳关西路再也没有老友人。\n" +
                        "诗词赏析：\n" +
                        "《渭城曲》是唐代诗人王维创作的一首诗。此诗前两句写渭城驿馆风景，交待送别的时间、地点、环境气氛；后二句转入伤别，却不着伤字，只用举杯劝酒来表达内心强烈深沉的惜别之情。全诗以洗尽雕饰、明朗自然语言抒发别情，写得情景交融，韵味深永，具有很强的艺术感染力，落成之后便被人披以管弦，殷勤传唱，并成为流传千古的名曲。\n",
                5, false);
        insertPoem(db, 5018, "秋夜将晓出篱门迎凉有感", "南宋 陆游",
                "三万里河东入海⑷，\n五千仞岳上摩天⑸。\n" +
                        "遗民泪尽胡尘里⑹，\n南望王师又一年⑺。\n",
                "词句注释：\n" +
                        "⑷三万里：长度，形容它的长，是虚指。河：指黄河。\t" +
                        "⑸五千仞（rèn）：形容它的高。仞，古代计算长度的一种单位，周尺八尺或七尺，周尺一尺约合二十三厘米。岳：指五岳之一西岳华山。黄河和华山都在金人占领区内。一说指北方泰、恒、嵩、华诸山。摩天：迫近高天，形容极高。摩，摩擦、接触或触摸。\t" +
                        "⑹遗民：指在金占领区生活的汉族人民，却认同南宋王朝统治的人民。泪尽：眼泪流干了，形容十分悲惨、痛苦。胡尘：指金人入侵中原，也指胡人骑兵的铁蹄践踏扬起的尘土和金朝的暴政。胡，中国古代对北方和西方少数民族的泛称。\t" +
                        "⑺南望：远眺南方。王师：指宋朝的军队。\n" +
                        "白话译文：\n" +
                        "三万里长的黄河奔腾向东流入大海，五千仞高的华山耸入云霄上摩青天。\n" +
                        "中原人民在胡人压迫下眼泪已流尽，他们盼望王师北伐盼了一年又一年。\n" +
                        "诗词赏析：\n" +
                        "第二首写大好河山，陷于敌手，以“望”字为眼，表现了诗人希望、失望而终不绝望的千回百转的心情。诗境雄伟、严肃、苍凉、悲愤。\n",
                5, false);
        insertPoem(db, 5019, "黄鹤楼送孟浩然之广陵", "唐 李白",
                "故人西辞黄鹤楼⑵，烟花三月下扬州⑶。\n" +
                        "孤帆远影碧空尽⑷，唯见长江天际流⑸。\n",
                "词句注释：\n" +
                        "⑴黄鹤楼：故址在今湖北武汉市武昌蛇山的黄鹄矶上，属于长江下游地带，传说三国时期的费祎于此登仙乘黄鹤而去，故称黄鹤楼。原楼已毁，现存楼为1985年修葺。孟浩然：李白的朋友。之：往、到达。广陵：即扬州。\t" +
                        "⑵故人：老朋友，这里指孟浩然。其年龄比李白大，在诗坛上享有盛名。李白对他很敬佩，彼此感情深厚，因此称之为“故人”。辞：辞别。\t" +
                        "⑶烟花：形容春天薄雾霭霭、柳絮如烟、鲜花掩映的景物，指艳丽的春景。下：顺流向下而行。\t" +
                        "⑷碧空尽：消失在碧蓝的天际。尽：尽头，消失了。碧空：一作“碧山”。\t" +
                        "⑸唯见：只看见。天际流：流向天边 天际：天边，天边的尽头。\n" +
                        "白话译文：\n" +
                        "旧友告别了黄鹤楼向东而去，在烟花如织的三月漂向扬州。\n" +
                        "帆影渐消失于水天相连之处，只见滚滚长江水在天边奔流。\n" +
                        "诗词赏析：\n" +
                        "《黄鹤楼送孟浩然之广陵》是唐代大诗人李白创作的一首送别诗。首句点出送别的地点：一代名胜黄鹤楼；二句写送别的时间与去向：“烟花三月”的春色和东南形胜的“扬州”；三、四句，写送别的场景：目送孤帆远去；只留一江春水。全诗寓离情于写景之中，以绚丽斑驳的烟花春色和浩瀚无边的长江为背景，极尽渲染之能事，绘出了一幅意境开阔、情丝不绝、色彩明快、风流倜傥的诗人送别画。此诗虽为惜别之作，却写得飘逸灵动，情深而不滞，意永而不悲，辞美而不浮，韵远而不虚。\n",
                5, false);
        insertPoem(db, 5020, "寒菊", "南宋 郑思肖",
                "花开不并百花丛，\n" +
                        "独立疏篱趣未穷。\n" +
                        "宁可枝头抱香死，\n" +
                        "何曾吹落北风中！\n",
                "词句注释：\n" +
                        "1、不并：不合、不靠在一起。并，一起。\t" +
                        "2、疏篱：稀疏的篱笆。\t" +
                        "3、未穷：未尽，无穷无尽。\t" +
                        "4、抱香死：菊花凋谢后不落，仍系枝头而枯萎，所以说抱香死。\t" +
                        "5、何曾：哪曾、不曾。\t" +
                        "6、北风：寒风，此处语意双关，亦指元朝的残暴势力。\n" +
                        "白话译文：\n" +
                        "你在秋天盛开，从不与百花为丛。独立在稀疏的篱笆旁边，你的情操意趣并未衰穷。宁可在枝头上怀抱着清香而死，绝不会吹落于凛冽北风之中！\n" +
                        "诗词赏析：\n" +
                        "《寒菊》是南宋诗人郑思肖所写的一首七言绝句。这首咏物诗，以寒菊象征忠于故国决不向新朝俯首的凛然气节。诗中句句扣紧寒菊的自然物性来写，妙在这些自然物性又处处关合、暗示出诗人的情怀。“抱香”，喻指自己高洁的民族情操，“北风”，双关语，暗示北方来的蒙古统治者。全诗写得壮烈激昂，掷地有声。\n",
                5, false);
        insertPoem(db, 5021, "乡村四月", "南宋 翁卷",
                "绿遍山原白满川，子规声里雨如烟。\n" +
                        "乡村四月闲人少，才了蚕桑又插田。\n",
                "词句注释：\n" +
                        "1.山原：山陵和原野。白满川：指稻田里的水色映着天光。川：平地。\t" +
                        "2.子规：鸟名，杜鹃鸟。\t" +
                        "3.才了：刚刚结束。蚕桑：种桑养蚕。插田：插秧。\n" +
                        "白话译文：\n" +
                        "山坡田野间草木茂盛，稻田里的水色与天光相辉映。天空中烟雨蒙蒙，杜鹃声声啼叫，大地一片欣欣向荣的景象。\n" +
                        "四月到了，没有人闲着，刚刚结束了蚕桑的事又要插秧了。\n" +
                        "诗词赏析：\n" +
                        "《乡村四月》是南宋诗人翁卷创作的一首七言绝句。这首诗以清新明快的笔调，出神入化地描写了江南农村初夏时节的旖旎风光，表达了诗人对乡村生活的热爱之情。前两句写自然景象。“绿”，写树木葱郁，“白”，写水光映天。诗人从视觉角度着眼，描绘出明丽动人的山水色彩。第二句不仅以烟喻雨，写出了江南梅雨特有的景致，而且以催耕的鸟声，平添了无限的生机。后两句写农家的繁忙。“乡村四月闲人少”一句，绘尽农家四月人繁忙的景象；而第四句以“蚕桑”照应首句的“绿遍山原”，以“插田”照应首句的“白满川”，一个“才”和一个“又”两个虚字极富表现力，不言“忙”而“忙”意自见。\n",
                5, false);


    }

    private static void insertGradeSixPoems(SQLiteDatabase db) {
        insertPoem(db, 6001, "江上渔者", "北宋 范仲淹", "江上往来人，\n但爱鲈鱼美。\n" +
                        "君看一叶舟，\n出没风波里。\n",
                "释义：\n1.渔者：捕鱼的人。\t" +
                        "2.但：只\t" +
                        "3.爱：喜欢\t" +
                        "4.鲈鱼：一种头大口大、体扁鳞细、背青腹白、 味道鲜美的鱼，生活在近岸浅海夏秋进入淡水河川后，肉更肥美，尤以松江所产最为名贵。\t" +
                        "5.君：你。\t" +
                        "6.一叶舟：像漂浮在水上的一片树叶似的小船。\t" +
                        "7.出没：若隐若现。指一会儿看得见，一会儿看不见。\t" +
                        "8.风波：波浪。\n" +
                        "整体赏析:\n" +
                        "诗中饱含了诗人对那些驾着一叶扁舟出没于滔滔风浪中的渔民的关切与同情之心，也表达了诗人对“只爱鲈鱼美”的江上人规劝之意。在江上和舟中两种环境、“来往”和“出没”两种动态、吃鱼人和捕鱼人两种生活的强烈对比中，显示出了诗人的意旨所在。", 6, false);


        insertPoem(db, 6002, "江南春", "唐 杜牧",
                "千里莺啼绿映红，\n水村山郭酒旗风。\n南朝四百八十寺，\n多少楼台烟雨中",
                " 释义：\n莺啼：即莺啼燕语。\t" +
                        "郭：外城。此处指城镇。\t" +
                        "酒旗：一种挂在门前以作为酒店标记的小旗。\t" +
                        "南朝：指先后与北朝对峙的宋、齐、梁、陈政权。\t" +
                        "四百八十寺：南朝皇帝和大官僚好佛，在京城（今南京市）大建佛寺。据《南史·循吏·郭祖深传》说：“都下佛寺五百余所”。这里说四百八十寺，是虚数。\t" +
                        "楼台：楼阁亭台。此处指寺院建筑。\t" +
                        "烟雨：细雨蒙蒙，如烟如雾。\n" +
                        "译文：\n" +
                        "江南大地鸟啼声声绿草红花相映，水边村寨山麓城郭处处酒旗飘动。\t" +
                        "南朝遗留下的四百八十多座古寺，无数的楼台全笼罩在风烟云雨中。\n" +
                        "整体赏析:\n" +
                        "这首《江南春》，千百年来素负盛誉。四句诗，既写出了江南春景的丰富多彩，也写出了它的广阔、深邃和迷离。", 6, true);

        insertPoem(db, 6003, "游园不值", "南宋 叶绍翁",
                "应怜屐齿印苍苔⑵，\n小扣柴扉久不开⑶。\n" +
                        "春色满园关不住，\n一枝红杏出墙来。\n",
            "释义：\n" +
                    "⑴游园不值：想游园没能进门儿。值，遇到；不值，没得到机会。\t" +
                    "⑵应怜：大概是感到心疼吧。应，表示猜测；怜，怜惜。屐（jī）齿：屐是木鞋，鞋底前后都有高跟儿，叫屐齿。\t" +
                    "⑶小扣：轻轻地敲门。柴扉（fēi）：用木柴、树枝编成的门。\n" +
                    "白话译文：\n" +
                    "也许是园主担心我的木屐踩坏他那爱惜的青苔，轻轻地敲柴门，久久没有人来开。\n" +
                    "可是这满园的春色毕竟是关不住的，你看，那儿有一枝粉红色的杏花伸出墙头来。\n" +
                    "整体赏析:\n" +
                    "《游园不值》是南宋诗人叶绍翁的名篇，这首小诗写诗人春日游园所见所感。此诗先写诗人游园看花而进不了园门，感情上是从有所期待到失望遗憾；后看到一枝红杏伸出墙外，进而领略到园中的盎然春意，感情又由失望到意外之惊喜，写得十分曲折而有层次。尤其第三、四两句，既渲染了浓郁的春色，又揭示了深刻的哲理。全诗写得十分形象而又富有理趣，体现了取景小而含意深的特点，情景交融，脍炙人口", 6, false);

        insertPoem(db, 6003, "游园不值", "南宋 叶绍翁",
                "应怜屐齿印苍苔⑵，\n小扣柴扉久不开⑶。\n" +
                        "春色满园关不住，\n一枝红杏出墙来。\n",
                "释义：\n" +
                        "⑴游园不值：想游园没能进门儿。值，遇到；不值，没得到机会。\t" +
                        "⑵应怜：大概是感到心疼吧。应，表示猜测；怜，怜惜。屐（jī）齿：屐是木鞋，鞋底前后都有高跟儿，叫屐齿。\t" +
                        "⑶小扣：轻轻地敲门。柴扉（fēi）：用木柴、树枝编成的门。\n" +
                        "白话译文：\n" +
                        "也许是园主担心我的木屐踩坏他那爱惜的青苔，轻轻地敲柴门，久久没有人来开。\n" +
                        "可是这满园的春色毕竟是关不住的，你看，那儿有一枝粉红色的杏花伸出墙头来。\n" +
                        "整体赏析:\n" +
                        "《游园不值》是南宋诗人叶绍翁的名篇，这首小诗写诗人春日游园所见所感。此诗先写诗人游园看花而进不了园门，感情上是从有所期待到失望遗憾；后看到一枝红杏伸出墙外，进而领略到园中的盎然春意，感情又由失望到意外之惊喜，写得十分曲折而有层次。尤其第三、四两句，既渲染了浓郁的春色，又揭示了深刻的哲理。全诗写得十分形象而又富有理趣，体现了取景小而含意深的特点，情景交融，脍炙人口", 6, false);


    }

    private static void insertIdiomItems(SQLiteDatabase db) {
        insertIdiom(db, 00001, "明修栈道，暗度陈仓",
                "项羽自封为西楚霸王后，就向各诸侯分封领地，其中把巴蜀、汉中三郡分封给刘邦，立为汉王。\n" +
                        "刘邦在去领地途中令部下烧毁了栈道，他这是向项羽表白没有向东扩张的意图。刘邦待具备了一定的实力后，便抓住时机迅速挥师东进，其野心是要与项羽一争，韩信便出了“明修栈道，暗度陈仓”的计策。\n" +
                        "陈仓是刘邦进入关中的必经之地，两地之间有险山峻岭阻隔，又有雍王章邯的重兵把守。\n" +
                        "刘邦按韩信的计策派了最信任的大将——樊哙带领一万人去修五百里栈道，并以军令限一月内修好。当然，这样浩大的工程即使三年也不可能完成。\n" +
                        "正是这一点，迷惑麻痹了陈仓的守将。陈仓的雍王章邯万万没想到刘邦的精锐部队摸着无人知晓的小道翻山越岭偷袭了陈仓。\n" +
                        "刘邦通过“明修栈道，暗度陈仓”，顺利挺进到关中，站稳了脚跟，从此拉开了他开创汉王朝事业的大幕。",
                "这个成语，在军事上的含义是：从正面迷惑敌人，用来掩盖自己的攻击路线，而从侧翼进行突然袭击。这是声东击西、出奇制胜的谋略。引申开来，是指用明显的行动迷惑对方，使人不备的策略，也比喻暗中进行活动。有时也可将“明修栈道”省略掉，把“暗度陈仓”单独来使用。");
        insertIdiom(db, 00002, "成也萧何，败也萧何",
                "“成也萧何，败也萧何”是一句成语，为民间对西汉建国功臣韩信一生的经典概括。“成也萧何”是指韩信成为大将军是萧何推荐的；“败也萧何”是指韩信被杀是萧何出的计谋。不论是成功还是败亡都是由于同一个人。",
                "“成也萧何，败也萧何”是一句成语，为民间对西汉建国功臣韩信一生的经典概括。");
        insertIdiom(db, 00003, "牛李党争",
                "牛李党争，通常是指唐代统治后期的九世纪前半期以牛僧孺、李宗闵等为领袖的牛党与李德裕、郑覃等为领袖的李党之间的争斗。",
                "牛李党争是唐朝末年宦官专权、唐朝腐败衰落的集中表现，加深了唐朝后期的统治危机。");

    }

    private static void insertWrongListItems(SQLiteDatabase db) {
        insertWrongList(db, 00001, "Who are you?\n\t I'm Dora.");
        insertWrongList(db, 00002, "Who am I?\n\t You are Alice.");
        insertWrongList(db, 00003, "I don't like tea.");
        insertWrongList(db, 00004, "Jeff doesn't like tea.");
        insertWrongList(db, 00005, "How many chairs are there in the dining room?");
    }

    private static void insertVocabularyItems(SQLiteDatabase db) {
        insertVocabulary(db, 00001, "very", "adjective. 很，非常",
                "Thank you very much!");
        insertVocabulary(db, 00002,"afternoon", "noun. 下午",
                "Good afternoon!");
        insertVocabulary(db, 00002,"refrigerator", "noun. 冰箱",
                "There is one refrigerator in the living room!");
        insertVocabulary(db, 00003,"closet", "noun. 衣橱",
                "How many closets are there in the bedroom?");
        insertVocabulary(db, 00004,"plate", "noun. 盘子",
                "I like that white plate.");
        insertVocabulary(db, 00005,"white", "adjective. 白色的",
                "I like that white plate.");


    }

    private static void insertIdiom(SQLiteDatabase db, int idiomId, String idiomName, String idiomSource, String idiomMeaning) {
        ContentValues idiomValues = new ContentValues();
        idiomValues.put("IDIOM_ID", idiomId);
        idiomValues.put("IDIOM_NAME", idiomName);
        idiomValues.put("IDIOM_SOURCE", idiomSource);
        idiomValues.put("IDIOM_MEANING", idiomMeaning);
        db.insert("IDIOM", null, idiomValues);
    }

    private static void insertVocabulary(SQLiteDatabase db, int vocabularyId, String vocabularyName, String vocabularyMeaning, String vocabularyExample) {
        ContentValues vocabularyValues = new ContentValues();
        vocabularyValues.put("VOCABULARY_ID", vocabularyId);
        vocabularyValues.put("VOCABULARY_NAME", vocabularyName);
        vocabularyValues.put("VOCABULARY_MEANING", vocabularyMeaning);
        vocabularyValues.put("VOCABULARY_EXAMPLE", vocabularyExample);
        db.insert("VOCABULARY", null, vocabularyValues);
    }

    private static void insertWrongList(SQLiteDatabase db, int wrongListId, String wrongItem) {
        ContentValues wrongListValues = new ContentValues();
        wrongListValues.put("WRONG_LIST_ID", wrongListId);
        wrongListValues.put("WRONG_ITEM", wrongItem);
        db.insert("WRONG_LIST", null, wrongListValues);
    }


}
