package com.example.poems;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class PoemDatabaseHelper extends SQLiteOpenHelper {

    private static final String DB_NAME = "Poems"; //DB name
    private static final int DB_VERSION = 4; //DB version

    PoemDatabaseHelper(Context context) {
        super(context, DB_NAME, null, DB_VERSION);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        updateMyDatabase(db, 0, DB_VERSION);
    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        updateMyDatabase(db, oldVersion, newVersion);


    }

    private void updateMyDatabase(SQLiteDatabase db, int oldVersion, int newVersion) {
        if (oldVersion < 1) {
            db.execSQL("CREATE TABLE POEM (_id INTEGER PRIMARY KEY AUTOINCREMENT," +
                    "POEM_ID INTEGER, TITLE TEXT, AUTHOR TEXT, CONTENT TEXT, DESCRIPTION TEXT, GRADE INTEGER, IS_PASS NUMERIC);");
            insertGradeOnePoems(db);
            insertGradeTwoPoems(db);
            insertGradeThreePoems(db);


            insertPoem(db, 6001, "江上渔者", "北宋 范仲淹", "江上往来人，\n但爱鲈鱼美。\n" +
                            "君看一叶舟，\n出没风波里。\n",
                    "释义：\n1.渔者：捕鱼的人。\t" +
                            "2.但：只\t" +
                            "3.爱：喜欢\t" +
                            "4.鲈鱼：一种头大口大、体扁鳞细、背青腹白、 味道鲜美的鱼，生活在近岸浅海夏秋进入淡水河川后，肉更肥美，尤以松江所产最为名贵。\t" +
                            "5.君：你。\t" +
                            "6.一叶舟：像漂浮在水上的一片树叶似的小船。\t" +
                            "7.出没：若隐若现。指一会儿看得见，一会儿看不见。\t" +
                            "8.风波：波浪。\n" +
                            "整体赏析:\n" +
                            "诗中饱含了诗人对那些驾着一叶扁舟出没于滔滔风浪中的渔民的关切与同情之心，也表达了诗人对“只爱鲈鱼美”的江上人规劝之意。在江上和舟中两种环境、“来往”和“出没”两种动态、吃鱼人和捕鱼人两种生活的强烈对比中，显示出了诗人的意旨所在。", 5, false);
            insertPoem(db, 6002, "赠刘景文", "北宋 苏轼", "荷尽已无擎雨盖⑵，\n" +
                            "菊残犹有傲霜枝⑶。\n" +
                            "一年好景君须记⑷，\n" +
                            "正是橙黄橘绿时⑸。\n",
                    "释义：\n⑴刘景文：刘季孙，字景文，工诗，时任两浙兵马都监，驻杭州。苏轼视他为国士，曾上表推荐，并以诗歌唱酬往来。\t" +
                            "⑵荷尽：荷花枯萎，残败凋谢。擎：举，向上托。雨盖：旧称雨伞，诗中比喻荷叶舒展的样子。\t" +
                            "⑶菊残：菊花凋谢。犹：仍然。傲霜：不怕霜动寒冷，坚强不屈。\t" +
                            "⑷君：原指古代君王，后泛指对男子的敬称，您。须记：一定要记住。\t" +
                            "⑸正是：一作“最是”。橙黄橘绿时：指橙子发黄、橘子将黄犹绿的时候，指农历秋末冬初。\n" +
                            "译文：\n 荷花凋谢连那擎雨的荷叶也枯萎了，只有那开败了菊花的花枝还傲寒斗霜。一年中最好的景致你一定要记住，那就是在橙子金黄、橘子青绿的秋末冬初的时节啊。" +
                            "整体赏析:\n" +
                            "这首诗写的是初冬的景色。\n", 5, false);
            insertPoem(db, 6003, "塞下曲", "唐 卢纶",
                    "月黑雁飞高，\n单于夜遁逃。\n欲将轻骑逐，\n大雪满弓刀。",
                    "①塞下曲：古时边塞的一种军歌。\t" +
                            "②月黑：没有月光。\t" +
                            "③单于（chán yú ）：匈奴的首领。这里指入侵者的最高统帅。\t" +
                            "④遁：逃走。\t" +
                            "⑤将：率领。\t" +
                            "⑥轻骑：轻装快速的骑兵。\t" +
                            "⑦逐：追赶。\t" +
                            "⑧满：沾满。\n" +
                            "译文：\n" +
                            "暗淡的月夜里，一群大雁惊叫着高飞而起，暴露了单于的军队想要趁夜色潜逃的阴谋。将军率领轻骑兵一路追杀，顾不得漫天的大雪已落满弓和刀。",
                    5, true);
            insertPoem(db, 6004, "忆江南", "唐 白居易",
                    "江南好，\n风景旧曾谙。\n日出江花红胜火，\n春来江水绿如蓝，\n能不忆江南？",
                    "译文： \n" +
                            "江南的风景多么美好，风景久已熟悉。春天到来时，太阳从江面升起，把江边的鲜花照得比火红，碧绿的江水绿得胜过蓝草。怎能叫人不怀念江南？\n" +
                            "整体赏析: \n" +
                            "忆江南，本为唐教坊曲名，后用作词牌名。", 5, true);
            insertPoem(db, 6005, "江南春", "唐 杜牧",
                    "千里莺啼绿映红，\n水村山郭酒旗风。\n南朝四百八十寺，\n多少楼台烟雨中",
                    " 释义：\n莺啼：即莺啼燕语。\t" +
                            "郭：外城。此处指城镇。\t" +
                            "酒旗：一种挂在门前以作为酒店标记的小旗。\t" +
                            "南朝：指先后与北朝对峙的宋、齐、梁、陈政权。\t" +
                            "四百八十寺：南朝皇帝和大官僚好佛，在京城（今南京市）大建佛寺。据《南史·循吏·郭祖深传》说：“都下佛寺五百余所”。这里说四百八十寺，是虚数。\t" +
                            "楼台：楼阁亭台。此处指寺院建筑。\t" +
                            "烟雨：细雨蒙蒙，如烟如雾。\n" +
                            "译文：\n" +
                            "江南大地鸟啼声声绿草红花相映，水边村寨山麓城郭处处酒旗飘动。\t" +
                            "南朝遗留下的四百八十多座古寺，无数的楼台全笼罩在风烟云雨中。\n" +
                            "整体赏析:\n" +
                            "这首《江南春》，千百年来素负盛誉。四句诗，既写出了江南春景的丰富多彩，也写出了它的广阔、深邃和迷离。", 5, true);
            insertPoem(db, 6006, "蜂", "唐 罗隐", "不论平地与山尖，\n无限风光尽被占。\n" +
                            "采得百花成蜜后，\n为谁辛苦为谁甜。",
                    "释义：\n⑴山尖：山峰。\t" +
                            "⑵无限风光：极其美好的风景。占：占有，占据。\t" +
                            "⑶采：采取，这里指采取花蜜。\n" +
                            "整体赏析:\n" +
                            "不论平地与山尖，无限风光尽被占。无论是在平原还是在山野，到处都可以见到蜜蜂忙忙碌碌采蜜的身影。越是春光明媚、鲜花盛开的地方就越能吸引蜜蜂。这两句语气十分肯定，盛赞蜜蜂尽占美好的春光，表现了诗人对蜜蜂的羡慕与赞美之情。\n" +
                            "采得百花成蜜后，为谁辛苦为谁甜？这两句急转直下，由前面盛赞蜜蜂“占尽风光”转而咏叹它终生徒劳，所获甚少。采花、酿蜜本是蜜蜂的天职。它辛苦酿成的蜜主要是用来供养蜂王，或被人所用，自己享用的却很少，而这完全是出于它的本能，根本不会意识到这有什么不公平。可是诗人却从这里发现了问题，并替蜜蜂发出了“为谁辛苦为谁甜”的不平之鸣。\n", 5, true);
        }
    }

    private static void insertPoem(SQLiteDatabase db, int poemId, String title, String author, String content, String desc, int grade, boolean is_pass) {
        ContentValues poemValues = new ContentValues();
        poemValues.put("POEM_ID", poemId);
        poemValues.put("TITLE", title);
        poemValues.put("AUTHOR", author);
        poemValues.put("CONTENT", content);
        poemValues.put("DESCRIPTION", desc);
        poemValues.put("GRADE", grade);
        poemValues.put("IS_PASS", is_pass);
        db.insert("POEM", null, poemValues);
    }


    private static void insertGradeOnePoems(SQLiteDatabase db){
        insertPoem(db, 1001, "咏鹅", "唐 骆宾王",
                "鹅，鹅，鹅，\n曲项向天歌，\n白毛浮绿水，\n红掌拨清波。", "", 1, true);
        insertPoem(db, 1002, "江南", "汉乐府",
                "江南可采莲，\n莲叶何田田，\n鱼戏莲叶间，\n鱼戏莲叶东，\n鱼戏莲叶西，\n鱼戏莲叶南，\n鱼戏莲叶北。", "", 1, true);
        insertPoem(db, 1003, "画","唐 王维",
                "远看山有色，\n近听水无声。\n春去花还在，\n人来鸟不惊。\n", "", 1, true);
        insertPoem(db, 1004, "悯农（其二）","唐 李绅",
                "锄禾日当午， \n 汗滴禾下土。\n谁知盘中餐，\n粒粒皆辛苦。", "", 1, true);
        insertPoem(db, 1005, "古朗月行","唐 李白",
                "小时不识月，\n呼作白玉盘2。\n" +
                        "又疑瑶台镜3，\n飞在青云端。\n" +
                        "仙人垂两足4，\n桂树何团团5。\n" +
                        "白兔捣药成，\n问言与谁餐6？\n" +
                        "蟾蜍蚀圆影7，\n大明夜已残8。\n" +
                        "羿昔落九乌9，\n天人清且安10。\n" +
                        "阴精此沦惑11，\n去去不足观12。\n" +
                        "忧来其如何？\n凄怆摧心肝13。\n", "注释：\n" +
                        "1. 朗月行：乐府旧题。《乐府诗集》卷六五收录此题，列于《杂曲歌辞》。\t\t" +
                        "2. 呼作：称为。白玉盘：白玉做的盘子。\t\t" +
                        "3. 疑：怀疑。瑶台：传说中神仙居住的地方。《穆天子传》卷三：“天子宾于西王母，天子觞西王母于瑶池之上。西王母为天子谣曰：‘白云在天，山陵自出。道里悠远，山川间之。将子无死，尚能复来。’天子答之曰：‘予归东土，和治诸夏。万民平均，吾顾见汝。比及三年，将复而野。’”《武帝内传》称王母为“玄都阿母”。\t\t" +
                        "4. 仙人：传说驾月的车夫，叫望舒，又名纤阿。\t\t" +
                        "5. 何：一作“作”。团团：圆圆的样子。一作“团圆”。\t\t" +
                        "6. “白兔”二句：白兔老是忙着捣药，究竟是给谁吃呢？言外有批评长生不老药之意。问言：问。言，语助词，无实意。与谁：一作“谁与”。\t\t" +
                        "7. 蟾蜍：俗称癞蛤蟆。《五经通义》：“月中有兔与蟾蜍。”传说月中有三条腿的蟾蜍，因此古诗文常以“蟾蜍”指代月亮。但此诗中蟾蜍似另有所指。圆影：指月亮。\t\t" +
                        "8. 大明：指月亮。\t\t" +
                        "9. 羿（yì）：中国古代神话中射落九个太阳的英雄。《淮南子·本经训》记载：尧时十日并出，草木皆枯。尧命羿仰射十日，中其九。下面的“乌”即日。《五经通义》：“日中有三足乌。”所以日又叫阳乌。\t\t" +
                        "10. 天人：天上人间。\t\t" +
                        "11. 阴精：《史记·天官书》：“月者，天地之阴，金之精也。”阴精也指月。沦惑：沉沦迷惑。\t\t" +
                        "12. 去去：远去，越去越远。为决绝之辞。\t\t" +
                        "13. 凄怆：伤心之意。 \n", 1, true);
        insertPoem(db, 1006, "风","唐 李峤",
                "解落三秋叶，\n能开二月花。\n" +
                        "过江千尺浪，\n入竹万竿斜。\n", "《风》是唐代诗人李峤创作的一首诗。此诗通过抓住“叶”“花”“浪”“竹”四样自然界物象在风力作用下的易变，间接地表现了“风”之种种形力、魅力与威力：它能使晚秋的树叶脱落，能催开早春二月的鲜花，经过江河时能掀起千尺巨浪，刮进竹林时可把万棵翠竹吹得歪歪斜斜。全诗四句两两成偶，以“三”“二”“千”“万”数字对举排列来表现风的强大，也表达了诗人对大自然的敬畏之情。", 1, true);
        insertPoem(db, 1007, "春晓","唐 孟浩然",
                "春眠不觉晓，\n处处闻啼鸟。\n" +
                        "夜来风雨声，\n花落知多少。\n", "《春晓》是唐代诗人孟浩然隐居在鹿门山时所作，诗人抓住春天的早晨刚刚醒来时的一瞬间展开联想，描绘了一幅春天早晨绚丽的图景，抒发了诗人热爱春天、珍惜春光的美好心情。首句破题，写春睡的香甜；也流露着对朝阳明媚的喜爱；次句即景，写悦耳的春声，也交代了醒来的原因；三句转为写回忆，末句又回到眼前，由喜春翻为惜春。全诗语言平易浅近，自然天成，言浅意浓，景真情真，深得大自然的真趣。", 1, true);
        insertPoem(db, 1008, "赠汪伦","唐 李白",
                "李白乘舟将欲行，\n忽闻岸上踏歌声。\n" +
                        " 桃花潭水深千尺，\n不及汪伦送我情。\n", "《赠汪伦》是唐代大诗人李白于泾县（今安徽皖南地区）游历桃花潭时写给当地好友汪伦的一首留别诗。此诗前两句描绘李白乘舟欲行时，汪伦踏歌赶来送行的情景，朴素自然地表达出汪伦对李白那种朴实、真诚的情感；后两句先用“深千尺”赞美桃花潭水的深湛，紧接“不及”两个字笔锋一转，用衬托的手法，把无形的情谊化为有形的千尺潭水，生动形象地表达了汪伦对李白那份真挚深厚的友情。全诗语言清新自然，想象丰富奇特，虽仅四句二十八字，却是李白诗中流传最广的佳作之一。", 1, true);
        insertPoem(db, 1009, "静夜思","唐 李白",
                "床前明月光,\n疑是地上霜。\n" +
                        "举头望明月,\n低头思故乡。\n", "", 1, true);
        insertPoem(db, 1010, "寻隐者不遇","唐 贾岛",
                "松下问童子，\n言师采药去。\n只在此山中，\n云深不知处。\n", "", 1, true);
        insertPoem(db, 1011, "池上","唐 白居易",
                "小娃撑小艇，\n偷采白莲回。\n不解藏踪迹，\n浮萍一道开。\n", "", 1, true);
        insertPoem(db, 1012, "小池","宋 杨万里",
                "泉眼无声惜细流，\n树阴照水爱晴柔。\n小荷才露尖尖角，\n早有蜻蜓立上头。\n", "", 1, true);
        insertPoem(db, 1013, "画鸡","明 唐寅",
                "头上红冠不用裁，\n满身雪白走将来。\n平生不敢轻言语，\n一叫千门万户开。\n", "", 1, true);
    }


    private static void insertGradeTwoPoems(SQLiteDatabase db) {
        insertPoem(db, 2001, "梅花", "宋 王安石",
                "墙角数枝梅，\n凌寒独自开。\n遥知不是雪，\n为有暗香来。", "词句注释：\n" +
                        "1.凌寒：冒着严寒。\t" +
                        "2.遥：远远地。知：知道。\t" +
                        "3.为（wèi）：因为。暗香：指梅花的幽香。\n" +
                        "整体赏析：\n" +
                        "《梅花》是北宋诗人王安石创作的一首五言绝句。此诗前两句写墙角梅花不惧严寒，傲然独放；后两句写梅花的幽香，以梅拟人，凌寒独开，喻典品格高贵，暗香沁人，象征其才气谯溢。亦是以梅花的坚强和高洁品格喻示那些像诗人一样，处于艰难环境中依然能坚持操守、主张正义的人。全诗语言朴素，写得则非常平实内敛，却自有深致，耐人寻味。", 2, true);
        insertPoem(db, 2002, "小儿垂钓", "唐 胡令能",
                "蓬头稚子学垂纶1，\n侧坐莓苔草映身2。\n" +
                        "路人借问遥招手3，\n怕得鱼惊不应人4。\n", "词句注释：\n" +
                        "1.蓬头：形容小孩可爱。稚子：年龄小的、懵懂的孩子。垂纶（lún）：钓鱼。纶，钓鱼用的丝线。\t" +
                        "2. 莓（méi）：一种野草。苔：苔藓植物。映：遮映。\t" +
                        "3. 借问：向人打听问路。\t" +
                        "4. 应（yìng）：回应，答应，理睬。\n", 2, true);
        insertPoem(db, 2003, "登鹳雀楼", "唐 王之涣",
                "白日依山尽⑵，\n黄河入海流。\n" +
                        "欲穷千里目⑶，\n更上一层楼⑷。\n", "词句注释：\n" +
                        "⑴鹳雀楼：古名鹳鹊楼，因时有鹳鹊栖其上而得名，其故址在永济市境内古蒲州城外西南的黄河岸边。《蒲州府志》记载：“（鹳雀楼）旧在郡城西南黄河中高阜处，时有鹳雀栖其上，遂名。”\t" +
                        "⑵白日：太阳。依：依傍。尽：消失。 这句话是说太阳依傍山峦沉落。\t" +
                        "⑶欲：想要。穷：尽，使达到极点。千里目：眼界宽阔。\t" +
                        "⑷更：再。\n" +
                        "文学赏析\n" +
                        "这首诗写诗人在登高望远中表现出来的不凡的胸襟抱负，反映了盛唐时期人们积极向上的进取精神。\t" +
                        "书法家崔国伟行书《登鹳雀楼》\t" +
                        "书法家崔国伟行书《登鹳雀楼》\t" +
                        "前两句写所见。“白日依山尽”写山，“黄河入海流”写水。诗人遥望一轮落日向着楼前一望无际、连绵起伏的群山西沉，在视野的尽头冉冉而没；目送流经楼前下方的黄河奔腾咆哮、滚滚南来，又在远处折而东向，流归大海。诗人运用极其朴素、极其浅显的语言，既高度形象又高度概括地把进入广大视野的万里河山，收入短短十个字中，画面宽广辽远。\n" +
                        "知识拓展：\n" +
                        "四大名楼：四大名楼是一种泛称，特指山西永济鹳雀楼 、江西南昌滕王阁、湖北武汉黄鹤楼、湖南岳阳岳阳楼。", 2, true);
        insertPoem(db, 2004, "望庐山瀑布", "唐 李白",
                "日照香炉生紫烟，\n遥看瀑布挂前川。\n" +
                        "飞流直下三千尺，\n疑是银河落九天。\n", "词句注释：\n" +
                        "⑴庐山：又名匡山，中国名山之一。位于今江西省九江市北部的鄱阳湖盆地，在庐山区境内，耸立于鄱阳湖、长江之滨。\t" +
                        "⑵香炉峰：庐山香炉峰有四。此指南香炉峰。因烟云聚散，如香炉之状，故名。\t" +
                        "3. “日照”二句：一作“庐山上与星斗连，日照香炉生紫烟”。香炉：指香炉峰。紫烟：指日光透过云雾，远望如紫色的烟云。\t" +
                        "4. ”遥看：从远处看。挂：悬挂。前川：一作“长川”。川：河流，这里指瀑布。\t" +
                        "5. 直：笔直。三千尺：形容山高。这里是夸张的说法，不是实指。\t" +
                        "6. 疑：怀疑。银河：古人指银河系构成的带状星群。九天：极言天高。古人认为天有九重，九天是天的最高层，九重天，即天空最高处。\n", 2, true);
        insertPoem(db, 2005, "江雪", "唐 柳宗元",
                "千山鸟飞绝①，\n万径②人踪③灭。\n" +
                        "孤④舟蓑笠⑤翁，\n独⑥钓寒江雪。\n", "词句注释：\n" +
                        "①绝：无，没有。\t" +
                        "②万径：虚指，指千万条路。\t" +
                        "③人踪：人的脚印。\t" +
                        "④孤：孤零零。\t" +
                        "⑤蓑笠（suō lì）：蓑衣和斗笠。蓑：古代用来防雨的衣服；笠：古代用来防雨的帽子，用竹篾编成。\t" +
                        "⑥独：独自。\n" +
                        "诗词赏析：\n" +
                        "《江雪》是唐代诗人柳宗元于永州创作的一首五言绝句。诗中运用典型概括的手法，选择千山万径，人鸟绝迹这种最能表现山野严寒的典型景物，描绘大雪纷飞，天寒地冻的图景；接着勾画独钓寒江的渔翁形象，借以表达诗人在遭受打击之后不屈而又深感孤寂的情绪。全诗构思独特，语言简洁凝练，意蕴丰富。", 2, true);
        insertPoem(db, 2006, "夜宿山寺", "唐 李白",
                "危楼高百尺⑵，\n手可摘星辰⑶。\n" +
                        "不敢高声语⑷，\n恐惊天上人⑸。\n", "词句注释：\n" +
                        "⑴宿：住，过夜。\t" +
                        "⑵危楼：高楼，这里指山顶的寺庙。危：高。百尺：虚指，不是实数，这里形容楼很高。\t" +
                        "⑶星辰：天上的星星统称。\t" +
                        "⑷语：说话。\t" +
                        "⑸恐：唯恐，害怕。惊：惊动。\n" +
                        "诗词赏析：\n此诗运用了极其夸张的手法，描写了寺中楼宇的高耸，表达了诗人对古代庙宇工程艺术的惊叹以及对神仙般生活的向往和追求之情。全诗语言朴素自然，想象瑰丽，夸张巧妙，活灵活现，给人以丰富的联想和身临其境之感。\n", 2, true);
        insertPoem(db, 2007, "敕勒歌", "北朝民歌",
                "敕勒川②，\n" +
                        "阴山③下。\n" +
                        "天似穹庐④，\n" +
                        "笼盖四野⑤。\n" +
                        "天苍苍⑥，野茫茫⑦，\n" +
                        "风吹草低见牛羊⑧。\n", "词句注释：\n" +
                        "①《敕勒歌》：敕勒（chì lè）：种族名，北齐时居住在朔州（今山西省北部）一带。\t" +
                        "②敕勒川：川：平川、平原。敕勒族居住的地方，在现在的山西、内蒙一带。北魏时期把今河套平原至土默川一带称为敕勒川。\t" +
                        "③阴山：在今内蒙古自治区北部。\t" +
                        "④穹庐（qióng lú）：用毡布搭成的帐篷，即蒙古包。\t" +
                        "⑤笼盖四野（yǎ）：笼盖，另有版本作“笼罩”（洪迈《容斋随笔》卷一和胡仔《苕溪渔隐丛话》后集卷三十一）；四野，草原的四面八方。\t" +
                        "⑥天苍苍：苍苍：青色。苍，青，天苍苍，天蓝蓝的。\t" +
                        "⑦茫茫：辽阔无边的样子。\t" +
                        "⑧见（xiàn）：同“现”，显露。\n" +
                        "诗词赏析：\n《敕勒歌》选自《乐府诗集》，是南北朝时期黄河以北的北朝流传的一首民歌，一般认为是由鲜卑语译成汉语的。民歌歌咏了北国草原壮丽富饶的风光，抒写敕勒人热爱家乡热爱生活的豪情。 [1]  开头两句交代敕勒川位于高耸云霄的阴山脚下，将草原的背景衬托得十分雄伟。接着两句用“穹庐”作比喻，说天空如蒙古包，盖住了草原的四面八方，以此来形容极目远望，天野相接，无比壮阔的景象。最后三句描绘了一幅水草丰盛、牛羊肥壮的草原全景图。有静有动，有形象，有色彩。\n", 2, true);
        insertPoem(db, 2008, "村居", "清 高鼎",
                "草长莺飞二月天，\n拂堤杨柳醉春烟2。\n" +
                        "儿童散学归来早3，\n忙趁东风放纸鸢4。\n", "词句注释：\n" +
                        "1.村居：住在农村。\t" +
                        "2.拂堤杨柳：杨柳枝条很长，垂下来，微微摆动，像是在抚摸堤岸。醉：迷醉，陶醉。春烟：春天水泽、草木等蒸发出来的雾气。\t" +
                        "3.散学：放学。\t" +
                        "4.纸鸢：风筝。鸢，老鹰。\n" +
                        "诗词赏析：\n《村居》是清代诗人高鼎晚年归隐于上饶地区、闲居农村时创作的一首七言绝句。此诗第一、二句写时间和自然景物，具体生动地描写了春天里的大自然，写出了春日农村特有的明媚、迷人的景色；第三、四句写的是人物活动，描述了一群活泼的儿童在大好的春光里放风筝的生动情景。这首诗落笔明朗，用词洗练。全诗洋溢着欢快的情绪，给读者以美好的情绪感染。\n", 2, true);
        insertPoem(db, 2009, "咏柳", "唐 贺知章",
                "碧玉1妆2成一树3高，\n" +
                        "万条垂下绿丝绦4。\n" +
                        "不知细叶谁裁5出，\n" +
                        "二月春风似6剪刀。\n", "词句注释：\n" +
                        "1.碧玉：碧绿色的玉。这里用以比喻春天嫩绿的柳叶。\t" +
                        "2.妆：装饰，打扮。\t" +
                        "3.一树：满树。一：满，全。在中国古典诗词和文章中，数量词在使用中并不一定表示确切的数量。下一句的“万”，就是表示很多的意思。\t" +
                        "4.绦（tāo）：用丝编成的绳带。这里指像丝带一样的柳条。\t" +
                        "5.裁：裁剪。\t" +
                        "6.似：如同，好像。\n" +
                        "诗词赏析：\n《咏柳》是盛唐诗人贺知章写的一首七言绝句。这首诗是一首咏物诗。诗的前两句连用两个新美的喻象，描绘春柳的勃勃生气，葱翠袅娜；后两句更别出心裁地把春风比喻为“剪刀”，将视之无形不可捉摸的“春风”形象地表现出来，不仅立意新奇，而且饱含韵味。\n", 2, true);
        insertPoem(db, 2010, "赋得古原草送别", "唐 白居易",
                "离离原上草，\n一岁一枯荣。\n野火烧不尽，\n春风吹又生。\n" +
                        "远芳侵古道，\n晴翠接荒城。\n又送王孙去，\n萋萋满别情。\n", "词句注释：\n" +
                        "1.赋得：借古人诗句或成语命题作诗。诗题前一般都冠以“赋得”二字。这是古代人学习作诗或文人聚会分题作诗或科举考试时命题作诗的一种方式，称为\"赋得体\"。\t" +
                        "2.离离：青草茂盛的样子。\t" +
                        "3.一岁一枯荣：枯，枯萎。荣，茂盛。野草每年都会茂盛一次，枯萎一次。\t" +
                        "4.远芳侵古道：芳，指野草那浓郁的香气。远芳：草香远播。侵，侵占，长满。远处芬芳的野草一直长到古老的驿道上。\t" +
                        "5.晴翠：草原明丽翠绿。\t" +
                        "6.王孙：本指贵族后代，此指远方的友人。\t" +
                        "7.萋萋：形容草木长得茂盛的样子。\n" +
                        "白话译文\n" +
                        "原野上长满茂盛的青草，年年岁岁枯萎了又苍翠。\t" +
                        "原野上的大火无法烧尽，春风一吹它又生机勃发。\t" +
                        "芳草的馨香弥漫着古道，阳光照耀下碧绿连荒城。\t" +
                        "又送游子远行踏上古道，满怀离情望着萋萋芳草。\n" +
                        "诗词赏析：\n《赋得古原草送别》是唐代诗人白居易的成名作。此诗通过对古原上野草的描绘，抒发送别友人时的依依惜别之情。它可以看成是一曲野草颂，进而是生命的颂歌。诗的前四句侧重表现野草生命的历时之美，后四句侧重表现其共时之美。全诗章法谨严，用语自然流畅，对仗工整，写景抒情水乳交融，意境浑成，是“赋得体”中的绝唱。\n", 2, true);
        insertPoem(db, 2011, "晓出净慈寺送林子方", "宋 杨万里",
                "毕竟西湖六月中，\n风光不与四时同。\n" +
                        "接天莲叶无穷碧，\n映日荷花别样红。\n", "词句注释：\n" +
                        "⑴晓：天刚亮的时候。净慈寺：在杭州西湖南岸，全名“净慈报恩光孝禅寺”，与灵隐寺为杭州西湖南北山两大著名佛寺。林子方：即林枅，字子方，作者的朋友，官居直阁秘书。\t" +
                        "⑵荡：浅水湖。\t" +
                        "⑶却：回转。\t" +
                        "⑷毕竟： 到底，言外有名不虚传的意味。\t" +
                        "⑸四时：春夏秋冬四个季节。在这里指六月以外的其他时节。同：相同。\t" +
                        "⑹接天：像与天空相接。无穷碧：因莲叶面积很广，似与天相接，故呈现无边无际的碧绿。\t" +
                        "⑺别样红：红得特别出色。别样，宋代俗语，特别，不一样。\n" +
                        "白话译文：\n" +
                        "六月里的西子湖啊，到底特殊，秀丽的风光和其他时节迥然不同。\n" +
                        "碧绿的莲叶连接天际，浩渺无尽，红日与荷花相映，色彩分外鲜艳娇红。\n" +
                        "诗词赏析：\n其首二句以“毕竟”二字领起，一气而下，既协调了平仄，又强调了内心在瞬间掠过的独特感受。然后顺理成章，具体描绘这使他为之倾倒与动情的特异风光，着力表现在一片无穷无尽的碧绿之中那红得“别样”、娇艳迷人的荷花，将六月西湖那迥异于平时的绮丽景色，写得十分传神。诗的后两句是互文，文义上交错互见，使诗句既意韵生动，又凝练含蓄。\n", 2, true);
        insertPoem(db, 2012, "绝句", "唐 杜甫",
                "两个黄鹂鸣翠柳，\n一行白鹭上青天。\n" +
                        "窗含西岭千秋雪，\n门泊东吴万里船。\n", "词句注释：\n" +
                        "1.黄鹂：黄莺，鸣声悦耳。\t" +
                        "2.白鹭：鹭鸶，羽毛纯白，能高飞。\t" +
                        "3.窗含：谓由窗往外望西岭，好似嵌在窗框中，故曰窗含。西岭：即成都西南的岷山，其雪常年不化，故云千秋雪。这是想象之词。\t" +
                        "4.东吴：指长江下游的江苏一带。成都水路通长江，故云东吴万里船。\n" +
                        "白话译文：\n" +
                        "两只黄鹂在翠绿的柳枝间鸣叫，一行白鹭向湛蓝的高空里飞翔。\n" +
                        "西岭雪山的景色仿佛嵌在窗里，往来东吴的航船就停泊在门旁。\n" +
                        "诗词赏析：\n诗描写早春景象，四句四景，又融为一幅生机勃勃的图画，在欢快明亮的景象内，寄托着诗人对时光流逝、孤独无聊的失落之意。\n", 2, true);
        insertPoem(db, 2013, "悯农（其一）", "唐 李绅",
                "春种一粒粟⑵，\n秋收万颗子⑶。\n" +
                        "四海无闲田⑷，\n农夫犹饿死⑸。\n", "词句注释：\n" +
                        "⑴悯：怜悯。这里有同情的意思。诗一作《古风二首》。这两首诗的排序各版本有所不同。\t" +
                        "⑵粟：泛指谷类。\t" +
                        "⑶秋收：一作“秋成”。子：指粮食颗粒。\t" +
                        "⑷四海：指全国。闲田：没有耕种的田。\t" +
                        "⑸犹：仍然。\n" +
                        "白话译文：\n" +
                        "春天播种下一粒种子，到了秋天就可以收获很多的粮食。\n" +
                        "天下没有一块不被耕作的田，可仍然有种田的农夫饿死。\n" +
                        "诗词赏析：\n具体而形象地描绘了到处硕果累累的景象，突出了农民辛勤劳动获得丰收却两手空空、惨遭饿死的现实问题。\n", 2, true);
        insertPoem(db, 2014, "舟夜书所见", "清 查慎行",
                "月黑见渔灯2，\n孤光一点萤3。\n" +
                        "微微风簇浪4，\n散作满河星。\n", "词句注释：\n" +
                        "1.舟夜书所见：夜晚在船上记下所看见的景象。书，记、写。\t" +
                        "2.渔灯：渔船上的灯火。\t" +
                        "3.孤光：孤零零的灯光。萤：萤火虫，比喻灯光像萤火虫一样微弱。\t" +
                        "4.风簇浪：风吹起了波浪。簇，聚集，簇拥。\n" +
                        "白话译文：\n" +
                        "漆黑之夜不见月亮，只见那渔船上的灯光，孤独的灯光在茫茫的夜色中，像萤火虫一样发出一点微亮。\n" +
                        "微风阵阵，河水泛起层层波浪，渔灯微光在水面上散开，河面好像撤落无数的星星。\n" +
                        "诗词赏析：\n《舟夜书所见》是清代诗人查慎行创作的一首五言绝句。此诗前两句写黑夜舟中见渔灯，茫茫黑夜只有河中一盏渔灯，明暗鲜明且显得神秘、深沉；后两句写孤灯倒影的美景，微风吹起波浪，灯影随即散开像散落在满河的星星。全诗纯用白描，以大景衬小景，以暗景衬亮景，刻画细腻，生动形象。\n", 2, true);
    }

    private static void insertGradeThreePoems(SQLiteDatabase db) {
        insertPoem(db, 3001, "所见", "清 袁枚",
                "牧童2骑黄牛3，\n歌声振4林樾5。\n" +
                        "意欲6捕鸣蝉7，\n忽然闭口8立。\n", "词句注释：\n" +
                        "1.所见：写诗人所看见的事物。\t" +
                        "2.牧童：放牧牛羊的小孩。这里是指放牛的娃娃。\t" +
                        "3.黄牛：牛的一种毛多呈黄色，也有黑色或红棕色。能耕地拉车，体型比水牛小。一般分为蒙古牛、华北牛和华南牛三大类型。\t" +
                        "4.振：振荡；回荡。说明牧童的歌声嘹亮。\t" +
                        "5.林樾（yuè）：指道旁成阴的树林。樾，树荫。\t" +
                        "6.意欲：想要。\t" +
                        "7.鸣蝉：鸣叫的知了。\t" +
                        "8.闭口：闭上嘴巴，不发出声音的意思。\n" +
                        "白话译文：\n" +
                        "牧童骑在黄牛背上，嘹亮的歌声在林中回荡。\n" +
                        "忽然想要捕捉树上鸣叫的知了，就马上停止唱歌，一声不响地站立在树旁。\n" +
                        "诗词赏析：\n" +
                        "《所见》是清代文学家袁枚创作的一首五言绝句。此诗写了作者偶然所见牧童骑牛唱歌想捕捉知了的一件小事，通过对牧童的动作神态变化的描写，表现了牧童天真活泼机智灵活的性格和热爱大自然情趣的特点。描绘了一幅林中牧童一派天真快乐的画面，表达了作者对田园风光的喜爱之情。全诗通过对自然环境和社会生活的描写，直接抒发生活的感受，看似闲情逸致，实则寄托情思，用语活泼自由、浅显明了。\n",
                3, true);
        insertPoem(db, 3002, "山行", "唐 杜牧",
                "远上寒山石径斜⑵，白云生处有人家⑶。\n" +
                        "停车坐爱枫林晚⑷，霜叶红于二月花⑸。\n", "词句注释：\n" +
                        "⑴山行：在山中行走。\t" +
                        "⑵远上：登上远处的。寒山：深秋季节的山。石径：石子铺成的小路。\t" +
                        "⑶生：明万历赵宦光刊本《万首唐人绝句》、明高棅编《唐诗品汇》、清陈梦雷编《古今图书集成》和康熙《御定全唐诗》作“深”。\t" +
                        "⑷坐：因为。枫林晚：傍晚时的枫树林。\t" +
                        "⑸霜叶：枫树的叶子经深秋寒霜之后变成了红色。于：比。\n" +
                        "白话译文：\n" +
                        "弯曲的石头小路远远地伸至深秋的山巅，在白云升腾的地方隐隐约约有几户人家。\n" +
                        "停下马车来是因为喜爱深秋枫林的晚景，霜染后枫叶那鲜艳的红色胜过二月春花。\n" +
                        "诗词赏析：\n" +
                        "《山行》是唐代诗人杜牧创作的一首诗。此诗描绘秋日山行所见的景色，展现出一幅动人的山林秋色图，山路、人家、白云、红叶，构成一幅和谐统一的画面，表现了作者的高怀逸兴和豪荡思致。作者以情驭景，敏捷、准确地捕捉足以体现自然美的形象，并把自己的情感融汇其中，使情感美与自然美水乳交融，情景互为一体。全诗构思新颖，布局精巧，于萧瑟秋风中摄取绚丽秋色，与春光争胜，令人赏心悦目，精神发越。\n",
                3, true);

    }
}
